config/doom/config-personal.org
#+title: Emacs Config: Personal
#+author: Cash Weaver
#+email: cashbweaver@gmail.com
#+startup: showeverything

This is my Emacs configuration file; written in [[https://orgmode.org][=org-mode=]] in literate programming style and based heavily on the work of others[fn:1].

* General
#+begin_src emacs-lisp :tangle config-personal.el
(setq
 search-invisible t)

(use-package! dash
  :ensure t)
#+end_src

Fix error: "File mode specification error: (error Problem in magic-mode-alist with element ess-SAS-listing-mode-p)".

#+begin_src emacs-lisp :tangle config-personal.el
(require 'ess-site)
#+end_src

** User Information

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 user-full-name "Cash Prokop-Weaver"
 user-mail-address "cashbweaver@gmail.com")
#+end_src

** Date and Time

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 ;; Use YYYY-MM-DD date format.
 calendar-date-style 'iso)
#+end_src

*** Helper Functions

**** Dates and time
#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/is-weekday (time)
  (cl-member (format-time-string "%a" time)
             '("Mon" "Tue" "Wed" "Thu" "Fri")
             :test #'equal))

(let ((sunday (date-to-time "2023-01-01T08:00:00-0700"))
      (monday (date-to-time "2023-01-02T08:00:00-0700")))
  (cl-assert
   (equal
    (---truthy? (cashpw/is-weekday sunday))
    nil))
  (cl-assert
   (equal
    (---truthy? (cashpw/is-weekday monday))
    t)))

(defun cashpw/is-weekend (time)
  (not (cashpw/is-weekday time)))

(let ((sunday (date-to-time "2023-01-01T08:00:00-0700"))
      (monday (date-to-time "2023-01-02T08:00:00-0700")))
  (cl-assert
   (equal
    (---truthy? (cashpw/is-weekend sunday))
    t))
  (cl-assert
   (equal
    (---truthy? (cashpw/is-weekend monday))
    nil)))

(defun cashpw/format-time (&optional time-format offset-days)
  "Return the date, with optional OFFSET-DAYS, in format."
  (interactive)
  (let* ((time-format (or time-format
                          "%Y-%m-%d"))
         (offset-days (or offset-days
                          0))
         (time (cond
                ((= offset-days
                    0)
                 (current-time))
                (t
                 (time-add (current-time)
                           (days-to-time offset-days))))))
    (format-time-string time-format
                        time)))

(defun cashpw/todays-date (&optional time-format)
  "Return the date, with optional OFFSET-DAYS, in format."
  (cashpw/format-time time-format))
#+end_src

** Packages
*** =command-log-mode=

For showing which keys I'm pressing during screencasts, presentations, or pairing sessions.

Alternatives include:

- [[https://gitlab.com/screenkey/screenkey][screenkey]]: "A screencast tool to display your keys inspired by Screenflick"

**** Package

#+begin_src emacs-lisp :tangle packages-personal.el
(package! command-log-mode)
#+end_src

**** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! command-log-mode
  :config
  (setq
   command-log-mode-open-log-turns-on-mode t
   command-log-mode-window-size 80
   command-log-mode-is-global t))
#+end_src

**** Usage

#+begin_src emacs-lisp
;; Enable the global mode
(global-command-log-mode)

;; Toggle the log buffer
(clm/toggle-command-log-buffer)
#+end_src
*** =centered-cursor-mode=

**** Package

#+begin_src emacs-lisp :tangle packages-personal.el
(package! centered-cursor-mode)
#+end_src

**** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! centered-cursor-mode)
#+end_src

*** =evil=

Doom emacs provides =evil=

#+begin_src emacs-lisp :tangle config-personal.el
(after! evil
  ;; Speed up org-mode table editing
  ;; https://github.com/emacs-evil/evil/issues/1623#issuecomment-1414406022
  (advice-remove 'set-window-buffer #'ad-Advice-set-window-buffer))
#+end_src

*** =free-keys=

Show free bindings in current buffer.

**** Package
#+begin_src emacs-lisp :tangle packages-personal.el
(package! free-keys
  :recipe (:host github
           :repo "Fuco1/free-keys"))
#+end_src

**** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! free-keys)
#+end_src
*** =titlecase=

Convert English text to Title Case.

**** Package
#+begin_src emacs-lisp :tangle packages-personal.el
(package! titlecase)
#+end_src

**** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! titlecase)
#+end_src

** Notifications
*** =alert=
**** Package

Doom Emacs provides =alert=.

**** Config

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 alert-fade-time 60
 alert-default-style 'libnotify)
#+end_src

*** =org-wild-notifier=
**** Package

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-wild-notifier)
#+end_src

**** Config

#+begin_src emacs-lisp :tangle config-personal.el
;; Too early load error
(use-package! org-wild-notifier
  :config
  (setq
   org-wild-notifier-alert-time '(2))
  (org-wild-notifier-mode))
#+end_src

** Keybindings
*** General / Global

#+begin_src emacs-lisp :tangle config-personal.el
(map!
 ;; Keep in alphabetical order.
 (:leader
  :desc "at point" :n "h h" #'helpful-at-point
  :desc "Langtool" :n "t L" #'langtool-check
  (:prefix ("n")
   :desc "Store email link" :n "L" #'org-notmuch-store-link
   (:prefix ("A" . "Flashcards")
    :n "d" #'org-fc-dashboard
    :n "i" #'org-fc-init
    :n "u" #'org-fc-update
    :n "r" #'cashpw/org-fc-review-all
    :n "R" #'org-fc-review)
   (:prefix ("r")
    :n "c" #'cashpw/org-roam-node-from-cite))
  (:prefix ("p")
   :n "u" #'cashpw/projectile-refresh-known-paths)
  (:prefix ("t")
   :n "C" #'centered-cursor-mode
   :n "k" #'clm/toggle-command-log-buffer)))

(map!
 ;; Keep in alphabetical order.
 :map global-map
 "M-N" #'operate-on-number-at-point
 :v "C-r" #'cashpw/replace-selection
 (:prefix ("z")
  :n "O" #'evil-open-fold-rec))
#+end_src

#+RESULTS:

*** Helper Methods
**** =cashpw/evil-lambda-key=
#+begin_src emacs-lisp :tangle config-personal.el
; Reference; https://www.emacswiki.org/emacs/DocumentingKeyBindingToLambda
(defun cashpw/evil-lambda-key (mode keymap key def)
  "Wrap `evil-define-key' to provide documentation."
  (set 'sym (make-symbol (documentation def)))
  (fset sym def)
  (evil-define-key mode keymap key sym))
#+end_src

** Helper functions
*** =run-function-in-file=
#+begin_src emacs-lisp :tangle config-personal.el
(defun run-function-in-file (filepath function &optional arguments)
  (let ((args (or arguments
                  nil)))
    (save-excursion
      (find-file filepath)
      (apply function arguments)
      (write-file filepath)
      (kill-buffer (current-buffer)))))
#+end_src
*** Secrets

#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashpw/secrets-dir-path
  (s-lex-format "${cashpw/home-dir-path}/.config/secrets")
  "Path to directory containing secret files.")

(defun cashpw/secrets-get (name)
  "Get content of NAME secret file."
  (let ((secret-file-path (s-lex-format "${cashpw/secrets-dir-path}/${name}")))
    (if (file-exists-p secret-file-path)
        (with-temp-buffer
          (insert-file-contents secret-file-path)
          (buffer-string))
      "")))
#+end_src

*** File navigation

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/file--get-header-file-path (file-path)
  "Return the path to the header file for the provided FILE-PATH."
  (cond
   ((s-ends-with-p ".cc" file-path)
    (concat (file-name-sans-extension file-path) ".h"))
   ((s-ends-with-p "_test.cc" file-path)
    (concat (substring 0 (- (length file-path) 5)
                       (file-name-sans-extension file-path))
            ".h"))
   (t
    file-path)))

(defun cashpw/file--get-test-file-path (cpp-file-path)
  "Return the path to the test file for the provided FILE-PATH."
  (cond
   ((or (s-ends-with-p ".cc" file-path)
        (s-ends-with-p ".h" file-path))
    (concat (file-name-sans-extension file-path) "_test.cc"))
   (t
    file-path)))

(defun cashpw/cpp--get-source-file-path (cpp-file-path)
  "Return the path to the source file for the provided CPP-FILE-PATH."
  (concat (file-name-sans-extension cpp-file-path) ".cc"))

(defun cashpw/file--get-readme-file-path (file-path)
  "Return the path to the readme file for the provided FILE-PATH."
  (concat (file-name-directory file-path) "README.md"))

(defun cashpw/cpp--switch-to-header-file ()
  "Switch to the header file for the current buffer."
  (interactive)
  (find-file (cashpw/cpp--get-header-file-path buffer-file-name)))

(defun cashpw/cpp--switch-to-test-file ()
  "Switch to the test file for the current buffer."
  (interactive)
  (find-file (cashpw/cpp--get-test-file-path buffer-file-name)))

(defun cashpw/cpp--switch-to-source-file ()
  "Switch to the test file for the current buffer."
  (interactive)
  (find-file (cashpw/cpp--get-source-file-path buffer-file-name)))

(defun cashpw/file--switch-to-readme-file ()
  "Switch to the readme file for the current buffer."
  (interactive)
  (find-file (cashpw/file--get-readme-file-path buffer-file-name)))
#+end_src


*** =cashpw/directory-files--org=
#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/directory-files--org (dir-path &optional include-archive)
  "Return a list of all .org$ files at DIR-PATH; include .org_archive if INCLUDE-ARCHIVE is non-nil."
  (let ((match (if include-archive
                   "\\.org\\(_archive\\)?$"
                 "\\.org$")))
    (directory-files dir-path t match)))
#+end_src


* Doom Emacs
I use [[github:hlissner/doom-emacs][Doom Emacs]] as the base for my configuration to save time and get to coding faster than I would if I had to roll an entire configuration from scratch.

