config/doom/config-personal.org
***** Config

#+begin_src emacs-lisp :tangle config-personal.el
;; (use-package! org-msg
;;   :config
;;   (setq
;;    org-msg-options "html-postamble:nil H:6 num:nil ^:{[ toc:nil author:nil email:nil \\n:t]}"
;;    org-msg-startup "hidestars indent inlineimages"
;;    org-msg-greeting-fmt "\nHi%s,\n\n"
;;    ;; org-msg-recipient-names
;;    org-msg-default-alternatives '((new . (text html))
;;                                   (reply-to-html . (text html))
;;                                   (reply-to-text . (text)))
;;    org-msg-convert-citation t
;;    ;; org-msg-signature is redundant -- use `gnus-alias-identity-alist'
;;    )
;;   (org-msg-mode))
#+end_src

*** Compose in =org-mode=

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/compose-mail-org ()
  (interactive)
  (compose-mail)
  (message-goto-body)
  (setq *compose-html-org* t)
  (org-mode))

;; Deprecated in favor of org-mime `org-mime-edit-mail-in-org-mode'
(defun cashpw/mail-toggle-org-message-mode ()
  (interactive)
  (if (derived-mode-p 'message-mode)
      (progn
        (setq *compose-html-org* t)
        (org-mode)
        (message "enabled org-mode"))
    (progn
      (setq *compose-html-org* nil)
      (notmuch-message-mode)
      (message "enabled notmuch-message-mode"))))

(defun cashpw/mail-get-short-address (address)
  "Returns \"foo@\" for an ADDRESS of \"Foo <foo@bar.com>\"."
  (cond
   ((not (string-match "<" address))
    address)
   (t
    (replace-regexp-in-string
     ".*<\\(.*\\)@.*>"
     "\\1@"
     address))))

(defun cashpw/mail-create-follow-up-todo ()
  (interactive)
  (let* ((file
          cashpw/path--file--notes-todos)
         (to-short
          (cashpw/mail-get-short-address
           (message-field-value "To")))
         (from-short
          (cashpw/mail-get-short-address
           (message-field-value "From")))
         (subject
          (message-field-value "Subject"))
         (message-id
          (replace-regexp-in-string
           "<\\(.*\\)>"
           "\\1"
           (message-field-value "Message-ID")))
         (now
          (with-temp-buffer
            (org-mode)
            (org-time-stamp-inactive '(16))
            (buffer-substring-no-properties
             (point-min)
             (point-max)))))
    (with-current-buffer
        (get-file-buffer file)
      (goto-char
       (point-max))
      (org-insert-heading-respect-content)
      (org-todo "TODO")
      (insert
       (s-lex-format
        "[[notmuch:id:${message-id}][${subject} (${from-short} ➤ ${to-short})]]: Follow up :email:"
        ))
      (org-set-property
       "Created"
       now)
      (org-schedule
       nil))))

(defun cashpw/message-send-and-exit ()
  (interactive)
  (org-mime-htmlize)
  (notmuch-mua-send)
  (if (y-or-n-p "Create follow-up TODO?")
      (cashpw/mail-create-follow-up-todo))
  (kill-buffer
   (current-buffer)))
#+end_src

*** Custom =send-mail-function=

I need to use a different =send-mail-function= when sending email at work. I override =cashpw/send-mail-function=, etc, in =config-work.el=.

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/send-mail-function (&rest args)
  "Wrapper method for `send-mail-function' for easy overriding in work environment."
  (apply #'sendmail-query-once args))

(defun cashpw/message-send-mail-function (&rest args)
  "Wrapper method for `message-send-mail-function' for easy overriding in work environment."
  (apply #'message--default-send-mail-function args))

(setq
 send-mail-function #'cashpw/send-mail-function
 message-send-mail-function #'cashpw/message-send-mail-function)
#+end_src

*** Keybindings

#+begin_src emacs-lisp :tangle config-personal.el
(map!
 :map message-mode-map
 "C-c C-c" #'cashpw/message-send-and-exit)
(map!
 :map message-mode-map
 "C-c C-c" #'cashpw/message-send-and-exit)

(map!
 :map message-mode-map
 :localleader
 "e" #'org-mime-edit-mail-in-org-mode)

(after! notmuch
  ;; Keep in alphabetical order.
  (map!
   :map notmuch-message-mode-map
   "C-c C-c" #'cashpw/message-send-and-exit)

  (map!
   :map notmuch-message-mode-map
   :localleader
   "e" #'org-mime-edit-mail-in-org-mode)

  (map!
   :map notmuch-show-mode-map
   "M-RET" #'cashpw/notmuch-show-open-or-close-all)

  ;; Reply-all should be the default.
  (evil-define-key 'normal notmuch-show-mode-map "cr" 'notmuch-show-reply)
  (evil-define-key 'normal notmuch-show-mode-map "cR" 'notmuch-show-reply-sender)

  ;; Easy archive for my most-used tags.
  (evil-define-key 'normal notmuch-search-mode-map "A" 'notmuch-search-archive-thread)
  (evil-define-key 'normal notmuch-search-mode-map "a" 'cashpw/notmuch-search-super-archive)
  (evil-define-key 'visual notmuch-search-mode-map "a" 'cashpw/notmuch-search-super-archive)
  (evil-define-key 'normal notmuch-search-mode-map "f" 'cashpw/notmuch-search-follow-up)

  ;; Unbind "t", and re-bind it to "T", so we can set it up as a prefix.
  (evil-define-key 'normal notmuch-search-mode-map "t" nil)
  (evil-define-key 'normal notmuch-search-mode-map "T" 'notmuch-search-filter-by-tag)

  ;; Helpers for toggling often-used tags.
  (cashpw/evil-lambda-key 'normal notmuch-search-mode-map "t0" '(lambda ()
                                                           "Toggle p0"
                                                           (interactive)
                                                           (cashpw/notmuch-search-toggle-tag "p0")))
  (cashpw/evil-lambda-key 'normal notmuch-search-mode-map "tr" '(lambda ()
                                                           "Toggle Read!"
                                                           (interactive)
                                                           (cashpw/notmuch-search-toggle-tag "Read!")))
  (cashpw/evil-lambda-key 'normal notmuch-search-mode-map "tw" '(lambda ()
                                                           "Toggle waiting"
                                                           (interactive)
                                                           (cashpw/notmuch-search-toggle-tag "waiting"))))


#+end_src

** Calendar
*** Packages
**** =calfw= :disabled:

***** Package
Provided through =app/calendar= in =init.el=.

***** Config
#+begin_src emacs-lisp :tangle config-personal.el
;(use-package! calfw-cal
;  :config
;  (setq
;   ; Start the week on Monday
;   calendar-week-start-day 1))
;
;(use-package! calfw-ical)
;(use-package! calfw-org)
;
;(defun cashpw/calfw-open ()
;  "Open my calendar"
;  (interactive)
;  (cfw:open-calendar-buffer
;   :contents-sources
;   (list
;    (cfw:org-create-source "Green"))))
#+end_src

** =ediff=

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 ediff-split-window-function #'split-window-horizontally)
#+end_src

* Languages
** General
*** Completion

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 completion-ignore-case t)
#+end_src

*** Packages
**** =aggressive-indent=
***** Package

#+begin_src emacs-lisp :tangle packages-personal.el
(package! aggressive-indent)
#+end_src

**** =langtool=

See https://languagetool.org/

Install =LanguageTool=:

1. Download the [[https://languagetool.org/download/LanguageTool-stable.zip][latest stable build]].
2. Store it somewhere on your system.
3. Configure (see below).

***** Package

Doom emacs provides =langtool= through =init.el=.

***** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! langtool
  :init
  (setq
   langtool-language-tool-server-jar
   "~/third_party/LanguageTool-5.5/languagetool-server.jar"
   ;;langtool-language-tool-jar
   ;;"~/third_party/LanguageTool-5.5/languagetool-commandline.jar"
   )
  :config
  (setq
   langtool-default-language
   "en-US"
   langtool-mother-tongue
   "en"))
#+end_src

**** =operate-on-number=

#+begin_quote
Suppose the point is on some number.  If you want to double it,
invoke `operate-on-number-at-point' followed by some keys: * 2 RET.

/[[github:knu/operate-on-number.el/blob/master/operate-on-number.el][operate-on-number.el]]/
#+end_quote

***** Package

#+begin_src emacs-lisp :tangle packages-personal.el
(package! operate-on-number
  :recipe (:host github
           :repo "knu/operate-on-number.el"))
#+end_src

***** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! operate-on-number)
#+end_src

**** =writeroom-mode=

***** Package

=init.el= provides =writeroom-mode=.

***** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! writeroom-mode
  :config
  (setq
   +zen-mixed-pitch-modes '()
   writeroom-width 45))
#+end_src

** Emacs Lisp (elisp)

Use =aggressive-indent= when editing =elisp=.

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! aggressive-indent
  :config
  (add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode))
#+end_src

*** Packages
** Java
