config/doom/config-personal.el

(defun cashpw/contacts--get-next-annual-time (time)
  "TODO."
  (if (not (time-less-p time (current-time)))
      time
    (cl-destructuring-bind (seconds minutes hours days months years day-of-week daylight-savings-time-p utc-offset)
        (decode-time time)
      (let* ((current-year (nth 5 (decode-time (current-time))))
             (next-year (1+ current-year)))
        (encode-time seconds minutes hours days months next-year day-of-week daylight-savings-time-p utc-offset)))))


(cl-letf (((symbol-function 'current-time) (lambda ()
                                             (date-to-time "2022-10-05T08:00:00-0700"))))
  (cl-assert
   (equal
    (cashpw/contacts--get-next-annual-time (date-to-time "2022-10-10T08:00:00-0700"))
    (date-to-time "2022-10-10T08:00:00-0700")))
  (cl-assert
   (equal
    (cashpw/contacts--get-next-annual-time (date-to-time "2022-10-01T08:00:00-0700"))
    (date-to-time "2023-10-01T08:00:00-0700")))

  (cl-assert
   (equal
    (cashpw/contacts--get-next-annual-time (date-to-time "2000-10-10T08:00:00-0700"))
    (date-to-time "2023-10-10T08:00:00-0700")))
  (cl-assert
   (equal
    (cashpw/contacts--get-next-annual-time (date-to-time "2000-10-01T08:00:00-0700"))
    (date-to-time "2023-10-01T08:00:00-0700"))))

(defcustom cashpw/contacts--birthday-prop
  "BIRTHDAY"
  "Property name for a contact's birthday.")

(defcustom cashpw/contacts--reminders-heading
  "Reminders"
  "Heading text for the reminders heading.")

(cl-defun cashpw/contacts--has-prop-p (prop)
  "Returns nil if the contact lacks the PROP."
  (member
   prop
   (org-buffer-property-keys)))

(cl-defun cashpw/contacts--get-prop (prop)
  "Returns value of PROP or nil if PROP not found."
  (org-entry-get
   (point-min)
   prop))

(cl-defun cashpw/contacts--list-top-level-headings ()
  "TODO"
  (org-map-entries
   (lambda ()
     (org-entry-get nil "ITEM"))
   "LEVEL=1"))

(cl-defun cashpw/contacts--heading-exists-p (heading-text)
  "Return t if HEADING-TEXT is among top-level headings and nil otherwise."
  (and (org-find-exact-headline-in-buffer
        heading-text)
       t))

(cl-defun cashpw/contacts--top-level-heading-exists? (heading-text)
  "Return t if HEADING-TEXT is among top-level headings and nil otherwise."
  (member heading-text
          (cashpw/contacts--list-top-level-headings)))

(cl-defun cashpw/contacts--list-child-headings ()
  "TODO"
  (interactive)
  (org-map-entries
   (lambda ()
     (org-entry-get nil "ITEM"))
   nil 'tree))

(cl-defun cashpw/contacts--create-top-level-heading-if-absent (heading-text &optional pos)
  "Creates a top-level heading with HEADING-TEXT at POS if such a heading doesn't exist in buffer.

Returns nil if the heading already existed."
  (let ((pos
         (or pos
             (point-max))))
    (if (member heading-text
                (cashpw/contacts--list-top-level-headings))
        (cl-return-from
            cashpw/contacts--create-top-level-heading-if-absent
          nil))

    (goto-char
     pos)
    (org-insert-heading
     ;; arg
     nil
     ;; invisible-ok
     t
     ;; top
     t)
    (insert heading-text)))

(cl-defun cashpw/contacts--goto-heading (heading-text)
  "Move pointer to the heading with HEADING-TEXT.

Does nothing if such a heading is absent."
  (let ((heading-position
         (org-find-exact-headline-in-buffer
          heading-text)))
    (unless heading-position
      (cl-return-from
          cashwever/contacts--goto-heading
        nil))
    (goto-char
     heading-position)))

(defun cashpw/org-set-property--created-at (&optional time)
  "Set the CREATED_AT property for the current heading.

Time defaults to `(current-time)'."
  (let ((created-at-time (or time
                             (current-time))))
    (org-set-property "CREATED_AT"
                      (format-time-string "[%Y-%m-%d %a %H:%M:%S]"
                                          created-at-time))))
(defun cashpw/contacts-create-reminder (reminder-text &optional time repeater-interval)
  "Creates a reminder."
  (interactive "sReminder heading: ")
  (let* ((time-format-string (if repeater-interval
                                 (s-lex-format "<%F ${repeater-interval}>")
                               (s-lex-format "<%F>")))
         (time (or time
                   (org-read-date nil t)))
         (time-string (format-time-string time-format-string
                                          time)))
    (cashpw/contacts--create-top-level-heading-if-absent cashpw/contacts--reminders-heading)
    (cashpw/contacts--goto-heading cashpw/contacts--reminders-heading)
    (org-insert-todo-subheading nil)
    (insert reminder-text)
    (org-entry-put nil "SCHEDULED" time-string)
    (cashpw/org-set-property--created-at)))

(cl-defun cashpw/contacts-file-p ()
  "Contacts files are roam files."
  (org-roam-file-p))

(cl-defun cashpw/contacts--create-birthday-reminder ()
  "Creates an annual birthday reminder."
  (when (and (cashpw/contacts-file-p)
             (cashpw/contacts--has-prop-p cashpw/contacts--birthday-prop))
    (let ((contact-name (cashpw/contacts--get-name))
          (heading-text (s-lex-format
                         "${contact-name}'s Birthday")))
      (unless (cashpw/contacts--heading-exists-p
               heading-text)
        (let* ((birth-time (org-time-string-to-time
                            (org-read-date nil ;; with-time
                                           t   ;; to-time
                                           (cashpw/contacts--get-prop ;; from-string
                                            ;; TODO: Convert this to a defcustom.
                                            cashpw/contacts--birthday-prop)
                                           nil ;; prompt
                                           )
                            ))
               (reminder-time (cashpw/contacts--get-next-annual-time
                               birth-time)))
          (cashpw/contacts-create-reminder
           heading-text
           reminder-time
           "+1y"))))))

(defun cashpw/contacts--get-birthday-time ()
  "Get emacs time representation of the contact's birthday."
  (org-time-string-to-time
   (cashpw/contacts--get-prop
    cashpw/contacts--birthday-prop)))

(cl-defun cashpw/contacts-create-birthday-reminders (&optional advance-notice-days)
  "Create the following birthday reminders:

1. Annually on the person's birthday
2. Annually ADVANCE-NOTICE-DAYS before the person's birthday"
  (interactive)
  (when (and (cashpw/contacts-file-p)
             (cashpw/contacts--has-prop-p cashpw/contacts--birthday-prop))
    (let* ((birth-time (cashpw/contacts--get-birthday-time))
           (contact-name (cashpw/contacts--get-name))
           (birthday-heading-text (s-lex-format
                                   "${contact-name}'s birthday"))
           (advance-notice-days (or advance-notice-days
                                    30))
           (upcoming-birthday-heading-text (s-lex-format
                                            "${contact-name}'s birthday in ${advance-notice-days} days")))
      (unless (cashpw/contacts--heading-exists-p upcoming-birthday-heading-text)
        (let* ((reminder-time (cashpw/contacts--get-next-annual-time
                               (time-subtract birth-time
                                              (days-to-time
                                               advance-notice-days)))))
          (cashpw/contacts-create-reminder
           upcoming-birthday-heading-text
           reminder-time
           "++1y")))

      (unless (cashpw/contacts--heading-exists-p birthday-heading-text)
        (let* ((reminder-time (cashpw/contacts--get-next-annual-time
                               birth-time)))
          (cashpw/contacts-create-reminder
           birthday-heading-text
           reminder-time
           "++1y"))))))

(cl-defun cashpw/contacts--get-name (&optional path)
  (let ((path
         (or
          path
          (buffer-file-name
           (buffer-base-buffer)))))
    (unless path
      (cl-return-from
          cashpw/contacts--get-name
        nil))
    (with-current-buffer
        (get-file-buffer path)
      (pcase
          (org-collect-keywords '("TITLE"))
        (`(("TITLE" . ,val))
         (car val))))))

(defun cashpw/contacts-aniversaries (contact-file-directory &optional field)
  "Compute FIELD anniversaries for each contact.

Based on `org-contacts-anniversaries'."
  (let ((field
         (or field
             cashpw/contacts-field-birthday))
        (contact-files
         (org-roam--list-files
          (expand-file-name
           contact-file-directory))))
    ;; (cl-loop for file in contact-files
    ;;       for anniversary = (let ((anniversary
    ;;                                ))))
    ))

(defun cashpw/contacts--get-contacts ()
  (let ((org-roam-directory
         "~/proj/people")
        (org-roam-db-location
         "~/proj/people/org-roam.db"))
    (when (emacsql-live-p
           (org-roam-db--get-connection))
      (emacsql-close
       (org-roam-db--get-connection)))
    (org-roam-db)
    (org-roam-db-query
     [:select *
      :from nodes])))


;; (cashpw/contacts--create-birthday-reminder)
;; (cashpw/contacts--create-top-level-heading-if-absent "foo")
;; (cashpw/contacts--get-name)
;; (cashpw/contacts--list-top-level-headings)

(use-package! doct
  :commands (doct))
