config/doom/config-personal.org
***** TODO Move this to separate package file.

**** =citar=

Doom emacs installs =citar=.

**** =citar-org-roam=

#+begin_src emacs-lisp :tangle packages-personal.el
(package! citar-org-roam
  :recipe (:host github
           :repo "emacs-citar/citar-org-roam"))
#+end_src

**** =doct= ([[github:progfolio/doct][Declarative Org Capture Template]])

#+begin_quote
=doct= is a function that provides an alternative, declarative syntax for describing Org capture templates.

/[[github:progfolio/doct][progfolio/doct]]/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! doct)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! doct
  :commands (doct))
#+end_src

**** =ol-doi=

Digital Object Identifier (DOI) link support.

#+begin_quote
This library introduces the "doi" link type in Org, and provides code for opening and exporting such links.
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! ol-doi
  :recipe (:repo "https://git.savannah.gnu.org/git/emacs/org-mode.git"
           :branch "main"
           :files ("lisp/ol-doi.el")))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
;; (use-package! ol-doi
;;  :after org)
#+end_src

**** =orgaggregate=

#+begin_quote
Aggregating a table is creating a new table by computing sums, averages, and so on, out of material from the first table.

/[[github:abo-abo/org-download]]/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! orgtbl-aggregate)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! orgtbl-aggregate)
#+end_src

**** =oc= (Org Citations)

Emacs provides =oc= .

**** =org-ai=
#+begin_quote
Minor mode for Emacs org-mode that provides access to OpenAI API's.

/[[github:rksm/org-ai][rksm/org-ai]]/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-ai)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-ai
  :after org
  :commands (org-ai-mode)
  :init
  (add-hook 'org-mode-hook #'org-ai-mode)
  :custom
  (org-ai-openai-api-token (cashpw/secrets-get "openai")))
#+end_src

**** =org-cite=

#+begin_src emacs-lisp :tangle config-personal.el
(after! (:and oc
              memoize))
  ;; Speed up exports
  ;; (memoize 'citeproc-hash-itemgetter-from-any))
#+end_src

#+RESULTS:

**** =org-download=
#+begin_quote
This extension facilitates moving images from point A to point B.

Point A (the source) can be:

1. An image inside your browser that you can drag to Emacs.
1. An image on your file system that you can drag to Emacs.
1. A local or remote image address in kill-ring. Use the org-download-yank command for this. Remember that you can use "0 w" in dired to get an address.
1. A screenshot taken using gnome-screenshot, scrot, gm, xclip (on Linux), screencapture (on OS X) or , imagemagick/convert (on Windows). Use the org-download-screenshot command for this. Customize the backend with org-download-screenshot-method.

Point B (the target) is an Emacs org-mode buffer where the inline link will be inserted. Several customization options will determine where exactly on the file system the file will be stored.

/[[github:abo-abo/org-download]]/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-download)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-download
  :after org
  :custom
  (org-download-heading-lvl nil))
#+end_src

***** TODO Debug "Too early load" error

**** =org-habit=

#+begin_src emacs-lisp :tangle config-personal.el
(after! org-habit
  (setq
    org-habit-show-done-always-green t))
#+end_src

**** =org-fancy-priorities=
#+begin_src emacs-lisp :tangle config-personal.el
(remove-hook! 'org-mode-hook #'org-fancy-priorities-mode)
#+end_src

#+RESULTS:

