config/doom/config-personal.el

;; (use-package! ol-doi
;;  :after org)

(use-package! orgtbl-aggregate)

(use-package! org-ai
  :after org
  :commands (org-ai-mode)
  :init
  (add-hook 'org-mode-hook #'org-ai-mode)
  :custom
  (org-ai-openai-api-token (cashpw/secrets-get "openai")))

(after! (:and oc
              memoize))
  ;; Speed up exports
  ;; (memoize 'citeproc-hash-itemgetter-from-any))

(use-package! org-download
  :after org
  :custom
  (org-download-heading-lvl nil))

(after! org-habit
  (setq
    org-habit-show-done-always-green t))

(remove-hook! 'org-mode-hook #'org-fancy-priorities-mode)
