config/doom/config-personal.org
***** Redisplay

#+begin_src emacs-lisp :tangle config-personal.el
(after! org-fc
  (cl-defmethod org-fc-review-session--next ((review-session org-fc-review-session) &optional resuming)
    "Review the next card of the current session.

If RESUMING is non-nil, some parts of the buffer setup are skipped."
    (if (not (null (oref review-session positions)))
        (condition-case err
            (let* ((pos (pop (oref review-session positions)))
                   (card (oref pos card))
                   (path (oref card path))
                   (id (oref card id))
                   (type (oref card type)))
              (setf (oref review-session current-item) pos)
              (let ((buffer (find-buffer-visiting path)))
                (with-current-buffer (find-file path)
                  (unless resuming
                    ;; If buffer was already open, don't kill it after rating the card
                    (if buffer
                        (setq-local org-fc-reviewing-existing-buffer t)
                      (setq-local org-fc-reviewing-existing-buffer nil))
                    (org-fc-set-header-line))

                  (goto-char (point-min))
                  (org-fc-id-goto id path)

                  (org-fc-indent)
                  ;; Make sure the headline the card is in is expanded
                  (org-reveal)
                  (redisplay t)
                  (org-fc-narrow)
                  (org-fc-hide-keyword-times)
                  (org-fc-hide-drawers)
                  (org-fc-show-latex)
                  (org-display-inline-images)
                  (run-hooks 'org-fc-before-setup-hook)

                  (setq org-fc-review--timestamp (time-to-seconds (current-time)))
                  (let ((step (funcall (org-fc-type-setup-fn type) (oref pos pos))))
                    (run-hooks 'org-fc-after-setup-hook)

                    ;; If the card has a no-noop flip function,
                    ;; skip to rate-mode
                    (let ((flip-fn (org-fc-type-flip-fn type)))
                      (if (or
                           (eq step 'rate)
                           (null flip-fn)
                           (eq flip-fn #'org-fc-noop))
                          (org-fc-review-rate-mode 1)
                        (org-fc-review-flip-mode 1)))))))
          (error
           (org-fc-review-quit)
           (signal (car err) (cdr err))))
      (message "Review Done")
      (org-fc-review-quit))))
#+end_src

#+RESULTS:
: org-fc-review-session--next

***** Narrow
#+begin_src emacs-lisp :tangle config-personal.el

(defun org-fc-narrow ()
  "Narrow the outline tree.
Only parent headings of the current heading remain visible."
  (interactive)
  (let* ((tags (org-get-tags nil 'local)))
    ;; Find the first heading with a :narrow: tag or the top level
    ;; ancestor of the current heading and narrow to its region
    (save-excursion
      (while (not (equal (org-up-heading-safe)
                         1)))
      (org-narrow-to-subtree)
      (outline-hide-subtree))
    ;; Show only the ancestors of the current card
    (org-show-set-visibility org-fc-narrow-visibility)
    (if (member "noheading" tags) (org-fc-hide-heading))))


#+end_src

#+RESULTS:
: org-fc-narrow

**** =org-tempo=
Provide support for multi-character =org-mode= structure template shortcuts (e.g. =<sp= for python code; see [[id:ce915eb8-d352-4aa2-9dca-5ada71fd18e1][Blocks]])

#+begin_src emacs-lisp :tangle packages-personal.el
;; org-tempo is provided by org-mode
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-tempo)
#+end_src

**** =org-gcal=

#+begin_quote
org-gcal offers

- Fetch google calendar event
- Post/edit org element
- Sync between Org and Gcal

/[[github:kidd/org-gcal.el][kidd/org-gcal.el]]/
#+end_quote

Doom emacs provides =org-gcal=.

#+begin_src emacs-lisp :tangle packages-personal.el
(unpin! org-gcal)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-gcal--timestamp-from-event (event)
  (let* ((start-time (plist-get (plist-get event :start)
                                :dateTime))
         (end-time (plist-get (plist-get event :end)
                              :dateTime))
         (start-day  (plist-get (plist-get event :start)
                                :date))
         (end-day  (plist-get (plist-get event :end)
                              :date))
         (start (if start-time
                    (org-gcal--convert-time-to-local-timezone
                     start-time
                     org-gcal-local-timezone)
                  start-day))
         (end   (if end-time
                    (org-gcal--convert-time-to-local-timezone
                     end-time
                     org-gcal-local-timezone)
                  end-day))
         (old-time-desc (org-gcal--get-time-and-desc))
         (old-start (plist-get old-time-desc :start))
         (old-end (plist-get old-time-desc :start))
         (recurrence (plist-get event :recurrence)))
    ;; Keep existing timestamps for parent recurring events.
    (when (and recurrence old-start old-end)
      (setq start old-start
            end old-end))
    (cashpw/org-gcal--timestamp start end)))

(defun cashpw/org-gcal--timestamp (start end)
  (if (or (string= start end)
          (org-gcal--alldayp start end))
      (org-gcal--format-iso2org start)
    (if (and (= (plist-get (org-gcal--parse-date start) :year)
                (plist-get (org-gcal--parse-date end)   :year))
             (= (plist-get (org-gcal--parse-date start) :mon)
                (plist-get (org-gcal--parse-date end)   :mon))
             (= (plist-get (org-gcal--parse-date start) :day)
                (plist-get (org-gcal--parse-date end)   :day)))
        (format "<%s-%s>"
                (org-gcal--format-date start "%Y-%m-%d %a %H:%M")
                (org-gcal--format-date end "%H:%M"))
      (format "%s--%s"
              (org-gcal--format-iso2org start)
              (org-gcal--format-iso2org
               (if (< 11 (length end))
                   end
                 (org-gcal--iso-previous-day end)))))))

(defun cashpw/org-gcal--set-scheduled (_calendar-id event _update-mode)
  "See `org-gcal-after-update-entry-functions'."
  (org-schedule nil (cashpw/org-gcal--timestamp-from-event event)))

(defun cashpw/org-gcal--set-effort (_calendar-id event _update-mode)
  "Set Effort property based on EVENT if not already set.

Reference: https://github.com/kidd/org-gcal.el/issues/150#issuecomment-825837044"
  (when-let* ((start-time (plist-get (plist-get event :start)
                           :dateTime))
              (end-time (plist-get (plist-get event :end)
                                :dateTime))
              (diff (float-time
                     (time-subtract (org-gcal--parse-calendar-time-string end-time)
                                    (org-gcal--parse-calendar-time-string start-time))))
              (minutes (floor (/ diff 60))))
    (let ((effort (org-entry-get (point) org-effort-property)))
      (unless effort
        (message "need to set effort - minutes %S" minutes)
        (org-entry-put (point)
                       org-effort-property
                       (apply #'format "%d:%02d" (cl-floor minutes 60)))))))

(after! org-gcal
  (add-hook 'org-gcal-after-update-entry-functions
            #'cashpw/org-gcal--set-effort)
  ;; (add-hook 'org-gcal-after-update-entry-functions
  ;;           #'cashpw/org-gcal--set-scheduled)
  )
#+end_src

**** =org-gtasks= :disabled:

#+begin_quote
Export/import all Google Tasks to org files.

https://github.com/JulienMasson/org-gtasks
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
;; (package! org-gtasks
;;   :recipe (:host github
;;            :repo "JulienMasson/org-gtasks"))
#+end_src

**** =org-multi-clock=

**** =org-mime=

#+begin_quote
This program sends HTML email using Org-mode HTML export.

This approximates a WYSiWYG HTML mail editor from within Emacs, and can be useful for sending tables, fontified source code, and inline images in email.

/[[github:org-mime/org-mime][org-mime/org-mime]]/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-mime)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-mime)
#+end_src

***** TODO Debug "Too early load" error

**** =org-noter=
#+begin_quote
Org-noter’s purpose is to let you create notes that are kept in sync when you scroll through the document, but that are external to it - the notes themselves live in an Org-mode file. As such, this leverages the power of Org-mode (the notes may have outlines, latex fragments, babel, etc…) while acting like notes that are made inside the document. Also, taking notes is very simple: just press i and annotate away!

/[[github:weirdNox/org-noter][weirdNox/org-noter]]/
#+end_quote

I've customized org-noter to [[github:cashpw/org-noter/commit/e18a4314308d5dd211759682b1aeb083a822673d][wrap quoted text with =begin_quote=/=end_quote=]]

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-noter
  :recipe (:host github
           :repo "cashpw/org-noter"))
#+end_src

