config/doom/config-personal.org
**** =org-notmuch=

#+begin_quote
One of the more popular Notmuch [[[https://notmuchmail.org/][Notmuch]]] message reading clients is notmuch.el, or notmuch-mode, an Emacs major mode for interacting with Notmuch. It is included in the Notmuch package (as elpa-notmuch within the notmuch package in current Debian or as notmuch-emacs in Debian 10 or prior). The screenshots give a good overview of the mode.

[cite:@Notmuchemacs]
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! ol-notmuch)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! ol-notmuch
  :after org)
#+end_src
**** =org-protocol=

#+begin_quote
org-protocol intercepts calls from emacsclient to trigger custom actions without external dependencies.

https://orgmode.org/worg/org-contrib/org-protocol.html
#+end_quote

Doom provides =org-protocol=

**** =org-protocol-capture-html=

#+begin_quote
org-protocol is awesome, but browsers do a pretty poor job of turning a page’s HTML content into plain-text. However, Pandoc supports converting from HTML to org-mode, so we can use it to turn HTML into Org-mode content! It can even turn HTML tables into Org tables!

https://github.com/alphapapa/org-protocol-capture-html
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-protocol-capture-html
  :recipe (:host github
           :repo "alphapapa/org-protocol-capture-html"))
#+end_src

**** =org-ql=
#+begin_quote
/[[github:alphapapa/org-ql][alphapapa/org-ql]]/

This package provides a query language for Org files. It offers two syntax styles: Lisp-like sexps and search engine-like keywords.
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-ql)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-ql)
#+end_src

**** =vulpea=
#+begin_quote
A collection of functions for note taking based on =org= and =org-roam=. This repository primary goal is to be a tested library for other applications and utilities around note taking.

[cite:@VulpeaVulpeabuffer6a735c34f1f64e1f70da77989e9ce8da7864e5ffD12frostedVulpea]
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! vulpea)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! vulpea)
#+end_src

**** =org-roam=
#+begin_quote
Org-roam is a plain-text knowledge management system. It brings some of Roam's more powerful features into the Org-mode ecosystem.

Org-roam borrows principles from the Zettelkasten method, providing a solution for non-hierarchical note-taking. It should also work as a plug-and-play solution for anyone already using Org-mode for their personal wiki.

/[[github:org-roam/org-roam][org-roam/org-roam]]/
#+end_quote

Doom Emacs provides =org-roam=.

#+begin_src emacs-lisp :tangle packages-personal.el
(unpin! org-roam)
#+end_src

**** =doct-org-roam=

#+begin_src emacs-lisp :tangle packages-personal.el
(package! doct-org-roam
  :recipe (:host github
           :repo "cashpw/doct-org-roam"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! doct-org-roam
  :after doct)
#+end_src
**** =org-roam-ui=

#+begin_quote
Org-Roam-UI is a frontend for exploring and interacting with your [[https://github.com/org-roam/org-roam][org-roam]] notes.

https://github.com/org-roam/org-roam-ui
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-roam-ui)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-roam
  :after org)
#+end_src

**** =org-superstar=

#+begin_quote
TODO
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-superstar
  :disable t)
#+end_src

**** =org-super-agenda=

#+begin_quote
This package lets you "supercharge" your Org daily/weekly agenda. The idea is to group items into sections, rather than having them all in one big list.

/[[github:alphapapa/org-super-agenda][alphapapa/org-super-agenda]]/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-super-agenda)
#+end_src
**** =org-transclusion=
#+begin_quote
Org-transclusion lets you insert a copy of text content via a file link or ID link within an Org file. It lets you have the same content present in different buffers at the same time without copy-and-pasting it. Edit the source of the content, and you can refresh the transcluded copies to the up-to-date state. Org-transclusion keeps your files clear of the transcluded copies, leaving only the links to the original content.

[[github:nobiot/org-transclusion]]
#+end_quote


#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-transclusion)
#+end_src

**** =org-vcard=

#+begin_quote
=org-vcard= is a package for exporting and importing [[https://en.wikipedia.org/wiki/Vcard][vCards]] from within [[https://www.gnu.org/software/emacs/][GNU Emacs]]' [[http://orgmode.org/][Org mode]].

https://github.com/flexibeast/org-vcard#table-of-contents
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-vcard)
#+end_src
**** =ox-hugo=
#+begin_quote
ox-hugo is an Org exporter backend that exports Org to Hugo-compatible Markdown (Blackfriday) and also generates the front-matter (in TOML or YAML format).

/[[github:kaushalmodi/ox-hugo]]/
#+end_quote

My corporate profile loads [[github:cashpw/ox-hugo-corp][cashpw/ox-hugo-corp]] -- a corporate-safe version of ox-hugo.

#+begin_src emacs-lisp :tangle packages-personal.el
(when (not (cashpw/is-work-cloudtop-p))
  (package! ox-hugo))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(when (not (cashpw/is-work-cloudtop-p))
  (use-package! ox-hugo
    :after ox))
#+end_src

**** =ox-pandoc=
#+begin_quote
ox-pandoc is an exporter for Org mode which converts Org-mode files to a wide variety of other formats using the pandoc tool. Pandoc can produce PDFs, HTML, presentations, markdown files, office documents and e-pub publications as well as a number of other more specialised formats.

/[[github:emacsorphanage/ox-pandoc][emacsorphanage/ox-pandoc]]/
#+end_quote


#+begin_src emacs-lisp :tangle packages-personal.el
(package! ox-pandoc)
#+end_src

**** =org-protocol=

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-protocol
  :config
  (setq
   org-protocol-default-template-key "p"
   ;; cashpw/org-protocol--capture-template--protocol '("p" "Protocol" entry (file+headline "/tmp/notes.org" "Inbox")
   ;;                                                   "* %^{Title}\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?")
   ;; cashpw/org-protocol--capture-template--protocol-link '("L" "Protocol Link" entry (file+headline "/tmp/notes.org" "Inbox")
   ;;                                                        "* %? [[%:link][%:description]] \nCaptured On: %U")
   cashpw/org-protocol--capture-template--web-site '("Website"
                                                     :keys "w"
                                                     :file ""
                                                     :template "* %a :website:\n\n%U %?\n\n%:initial")
   ;; '("w" "Web site" entry (file "") "* %a :website:\n\n%U %?\n\n%:initial")
   ))

(use-package! org-protocol-capture-html
  ;; see https://github.com/alphapapa/org-protocol-capture-html for usage
  :after org-protocol)
#+end_src

**** =org-gtasks=

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-gtasks--get-client-secret ()
  "Return client secret for Cash Weaver's Google Tasks."
  (replace-regexp-in-string
   "\n"
   ""
   (with-temp-buffer
     (insert-file-contents
      (file-truename
       "~/.config/org-gtasks/client-secret"))
     (buffer-string))))

;; (use-package! org-gtasks
;;   :after org
;;   :config
;;   (setq
;;    cashpw/org-gtasks-client-id "TODO"
;;    cashpw/org-gtasks-client-secret (cashpw/org-gtasks--get-client-secret)
;;    org-gtasks-accounts '())
;;   (org-gtasks-register-account
;;    :name "People"
;;    :directory "~/proj/people"
;;    :client-id cashpw/org-gtasks-client-id
;;    :client-secret cashpw/org-gtasks-client-secret))
#+end_src

**** =org-vcard=

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-vcard)
#+end_src

*** Helper Methods
**** Insert a heading for today

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-mode--heading-text-for-today (&optinoal time-in-heading include-all-tags)
  "Return the heading text for today as a string."
  (let* ((time-in-heading (or time-in-heading
                              nil))
         (include-all-tags (or include-all-tags
                               nil))
         (today-week-number (cashpw/format-time "%W"))
         (today-quarter-number (cashpw/format-time "%q"))
         (today-year (cashpw/format-time "%Y"))
         (today-month-number (cashpw/format-time "%m"))
         (today-day-number (cashpw/format-time "%d"))
         (today-weekday-abbreviated-name (cashpw/format-time "%a"))
         (tags (if include-all-tags
                   (s-lex-format
                    ":${today-year}:${today-year}week${today-week-number}:${today-year}Q${today-quarter-number}:")
                 ""))
         (hh-mm (if time-in-heading
                    (concat " " (cashpw/format-time "%H:%M"))
                  ""))
         (yyyy-mm-dd (cashpw/format-time)))
    (s-lex-format
     "[${yyyy-mm-dd} ${today-weekday-abbreviated-name}${hh-mm}] ${tags}")))

(defun cashpw/org-mode-insert-heading-for-today (&optional top time-in-heading include-all-tags)
  "Insert a heading for today's date, with relevant tags."
  (interactive)
  (let ((heading-text
         (cashpw/org-mode--heading-text-for-today
          ;; top
          nil
          time-in-heading
          include-all-tags))
        (today-yyyy-mm-dd (cashpw/format-time "%Y-%m-%d"))
        (today-hh-mm (cashpw/format-time "%H:%M"))
        (today-weekday-abbreviated-name (cashpw/format-time "%a")))
    (if top
        (org-insert-heading nil t t)
      (org-insert-heading-respect-content))
    (insert
     heading-text)
    (org-set-property
     "Created"
     (format "[%s %s %s]"
             today-yyyy-mm-dd
             today-weekday-abbreviated-name
             today-hh-mm))))

(defun cashpw/org-mode-heading-marker-for-today ()
  "Return t if a heading for today exists.

Refer to `cashpw/org-mode-insert-heading-for-today'."
  (let ((headline-text
         (cashpw/org-mode--heading-text-for-today))
        (headline-marker
         (org-find-exact-headline-in-buffer
          headline-text)))
    headline-marker))
#+end_src

