config/doom/config-personal.el

(use-package! ol-notmuch
  :after org)

(use-package! org-ql)

(use-package! vulpea)

(use-package! doct-org-roam
  :after doct)

(use-package! org-roam
  :after org)

(when (not (cashpw/is-work-cloudtop-p))
  (use-package! ox-hugo
    :after ox))

(use-package! org-protocol
  :config
  (setq
   org-protocol-default-template-key "p"
   ;; cashpw/org-protocol--capture-template--protocol '("p" "Protocol" entry (file+headline "/tmp/notes.org" "Inbox")
   ;;                                                   "* %^{Title}\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?")
   ;; cashpw/org-protocol--capture-template--protocol-link '("L" "Protocol Link" entry (file+headline "/tmp/notes.org" "Inbox")
   ;;                                                        "* %? [[%:link][%:description]] \nCaptured On: %U")
   cashpw/org-protocol--capture-template--web-site '("Website"
                                                     :keys "w"
                                                     :file ""
                                                     :template "* %a :website:\n\n%U %?\n\n%:initial")
   ;; '("w" "Web site" entry (file "") "* %a :website:\n\n%U %?\n\n%:initial")
   ))

(use-package! org-protocol-capture-html
  ;; see https://github.com/alphapapa/org-protocol-capture-html for usage
  :after org-protocol)

(defun cashpw/org-gtasks--get-client-secret ()
  "Return client secret for Cash Weaver's Google Tasks."
  (replace-regexp-in-string
   "\n"
   ""
   (with-temp-buffer
     (insert-file-contents
      (file-truename
       "~/.config/org-gtasks/client-secret"))
     (buffer-string))))

;; (use-package! org-gtasks
;;   :after org
;;   :config
;;   (setq
;;    cashpw/org-gtasks-client-id "TODO"
;;    cashpw/org-gtasks-client-secret (cashpw/org-gtasks--get-client-secret)
;;    org-gtasks-accounts '())
;;   (org-gtasks-register-account
;;    :name "People"
;;    :directory "~/proj/people"
;;    :client-id cashpw/org-gtasks-client-id
;;    :client-secret cashpw/org-gtasks-client-secret))

(use-package! org-vcard)

(defun cashpw/org-mode--heading-text-for-today (&optinoal time-in-heading include-all-tags)
  "Return the heading text for today as a string."
  (let* ((time-in-heading (or time-in-heading
                              nil))
         (include-all-tags (or include-all-tags
                               nil))
         (today-week-number (cashpw/format-time "%W"))
         (today-quarter-number (cashpw/format-time "%q"))
         (today-year (cashpw/format-time "%Y"))
         (today-month-number (cashpw/format-time "%m"))
         (today-day-number (cashpw/format-time "%d"))
         (today-weekday-abbreviated-name (cashpw/format-time "%a"))
         (tags (if include-all-tags
                   (s-lex-format
                    ":${today-year}:${today-year}week${today-week-number}:${today-year}Q${today-quarter-number}:")
                 ""))
         (hh-mm (if time-in-heading
                    (concat " " (cashpw/format-time "%H:%M"))
                  ""))
         (yyyy-mm-dd (cashpw/format-time)))
    (s-lex-format
     "[${yyyy-mm-dd} ${today-weekday-abbreviated-name}${hh-mm}] ${tags}")))

(defun cashpw/org-mode-insert-heading-for-today (&optional top time-in-heading include-all-tags)
  "Insert a heading for today's date, with relevant tags."
  (interactive)
  (let ((heading-text
         (cashpw/org-mode--heading-text-for-today
          ;; top
          nil
          time-in-heading
          include-all-tags))
        (today-yyyy-mm-dd (cashpw/format-time "%Y-%m-%d"))
        (today-hh-mm (cashpw/format-time "%H:%M"))
        (today-weekday-abbreviated-name (cashpw/format-time "%a")))
    (if top
        (org-insert-heading nil t t)
      (org-insert-heading-respect-content))
    (insert
     heading-text)
    (org-set-property
     "Created"
     (format "[%s %s %s]"
             today-yyyy-mm-dd
             today-weekday-abbreviated-name
             today-hh-mm))))

(defun cashpw/org-mode-heading-marker-for-today ()
  "Return t if a heading for today exists.

Refer to `cashpw/org-mode-insert-heading-for-today'."
  (let ((headline-text
         (cashpw/org-mode--heading-text-for-today))
        (headline-marker
         (org-find-exact-headline-in-buffer
          headline-text)))
    headline-marker))
