config/doom/config-personal.org
**** Insert a heading for a span of time

#+begin_src emacs-lisp :tangle config-personal.el
(defun iso-week-to-time(year week day)
  "Convert ISO year, week, day to elisp time value.

Reference: https://emacs.stackexchange.com/a/43985"
  (apply #'encode-time
         (append '(0 0 0)
                 (-select-by-indices
                  '(1 0 2)
                  (calendar-gregorian-from-absolute (calendar-iso-to-absolute
                                                     (list week day year)))))))

(defun iso-beginning-of-week(year week)
  "Convert ISO year, week to elisp time for first day (Monday) of week.

Reference: https://emacs.stackexchange.com/a/43985"
  (iso-week-to-time year week 1))

(defun iso-end-of-week(year week)
  "Convert ISO year, week to elisp time for last day (Sunday) of week.

Reference: https://emacs.stackexchange.com/a/43985"
  (iso-week-to-time year week 7))

(defun cashpw/org-mode-insert-heading-with-time (heading-text start-date &optional end-date)
  "Insert a heading for a span of time."
  (interactive)
  (org-insert-heading-respect-content)
  (insert heading-text)
  (newline)
  (if end-date
      (insert
       (concat
        (format-time-string "[%Y-%m-%d %a]--" start-date)
        (format-time-string "[%Y-%m-%d %a]" end-date)))
    (insert
     (format-time-string "[%Y-%m-%d %a]" start-date))))
#+end_src

**** Insert a heading for this week

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-mode-insert-heading-for-this-week (&optional include-all-tags)
  "Insert a heading for this week, with relevant tags."
  (interactive)
  (let* ((include-all-tags (or include-all-tags
                               nil))
         (today-week-number (cashpw/format-time "%W"))
         (today-quarter-number (cashpw/format-time "%q"))
         (today-year (cashpw/format-time "%Y"))
         (beginning-of-week (iso-beginning-of-week
                             (string-to-number today-year)
                             (string-to-number today-week-number)))
         (end-of-week (iso-end-of-week
                       (string-to-number today-year)
                       (string-to-number today-week-number)))
         (tags (if include-all-tags
                   (s-lex-format
                    ":${today-year}week${today-week-number}:${today-year}Q${today-quarter-number}:")
                 (s-lex-format
                  ":${today-year}week${today-week-number}:")))
         (heading-text
          (s-lex-format
           "${today-year} Week ${today-week-number} ${tags}")))
    (cashpw/org-mode-insert-heading-with-time
     heading-text
     beginning-of-week
     end-of-week)))
#+end_src

**** Insert a log heading for today

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-mode-insert-heading-for-today-log ()
  "Insert a heading for today's date formatted for the log file."
  (interactive)
  (let* ((today-year
          (cashpw/format-time
           "%Y"))
         (today-month-number
          (cashpw/format-time
           "%m"))
         (today-day-number
          (cashpw/format-time
           "%d"))
         (today-YYYY-MM-DD
          (s-lex-format
           "${today-year}-${today-month-number}-${today-day-number}")
          ))
    (cashpw/org-mode-insert-heading-for-today)
    (org-insert-subheading
     nil)
    (insert
     (s-lex-format
      "[${today-YYYY-MM-DD} 08:00-09:00]"))
    (cl-loop for (start . end) in '(("09:00" . "10:00")
                                    ("10:00" . "11:00")
                                    ("11:00" . "12:00")
                                    ("14:00" . "15:00")
                                    ("15:00" . "16:00")
                                    ("16:00" . "17:00"))
             do
             (org-insert-heading
              nil)
             (insert
              (s-lex-format
               "[${today-YYYY-MM-DD} ${start}-${end}]")))))
#+end_src

**** Scheduling task for my calendar blocks

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 cashpw/-schedule-block-day '(:start "07:00" :end "19:00")
 cashpw/-schedule-block-one '(:start "07:00" :end "09:00")
 cashpw/-schedule-block-two '(:start "09:00" :end "11:00")
 cashpw/-schedule-block-three '(:start "14:00" :end "16:00")
 cashpw/-schedule-block-four '(:start "16:00" :end "18:00"))

(defun cashpw/org-schedule-for-block (block-time &optional date)
  (interactive)
  (let ((start-time (plist-get block-time :start))
        (end-time (plist-get block-time :end))
        (date (or date "today")))
    (org-schedule nil (format "%s %s-%s"
                              date
                              start-time
                              end-time))))

(defun cashpw/org-schedule-today-from-to (start-time end-time &optional date)
  (interactive)
  (let ((date (or date "today")))
    (org-schedule nil (format "%s %s-%s"
                              date
                              start-time
                              end-time))))
#+end_src

**** Schedule task

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org--schedule-today-at (start-time-as-string)
  "Schedule a task today at the specified time."
  (interactive "sWhen?: ")
  (message start-time-as-string)
  (string-match
   "^\\([1-9]\\|[01][0-9]\\|2[0-3]\\):?\\([0-5][0-9]\\)?$"
   start-time-as-string)
  (let
      ((hour
        (string-to-number
         (or
          (match-string 1 start-time-as-string)
          "0")))
       (minute
        (string-to-number
         (or
          (match-string 2 start-time-as-string)
          "0"))))
    (org-schedule nil (format "today %02d:%02d"
                              hour
                              minute))
    (message (number-to-string hour))
    ))
#+end_src

**** Schedule task for duration

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org--schedule-for (start-time end-time &optional date)
  (let ((date (or date "today")))
    (org-schedule nil (format "%s %s-%s"
                              date
                              start-time
                              end-time))))
    ;(org-schedule nil (format "%s %s-%s"
                              ;date
                              ;start-time
                              ;end-time))))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org--schedule-at-for-minutes (start-minute start-hour duration-in-minutes &optional date)
  (let* ((start-time-in-minutes-since-midnight
         (+ start-minute (* start-hour 60)))
        (end-time-in-minutes-since-midnight
         (+ start-time-in-minutes-since-midnight duration-in-minutes))
        (end-minute (mod end-time-in-minutes-since-midnight 60))
        (end-hour (/ end-time-in-minutes-since-midnight 60))
        (date (or date "today")))
    (org-schedule nil (format "%s %02d:%02d-%02d:%02d"
                              date
                              start-hour
                              start-minute
                              end-hour
                              end-minute))))
#+end_src

**** Scheduling task at start of pomodoro

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 cashpw/-schedule-pomodoro-one '(:start "09:00" :end "09:50")
 cashpw/-schedule-pomodoro-two '(:start "10:00" :end "10:50")
 cashpw/-schedule-pomodoro-three '(:start "11:00" :end "11:50")
 cashpw/-schedule-pomodoro-four '(:start "12:00" :end "12:50")
 cashpw/-schedule-pomodoro-five '(:start "13:00" :end "13:50")
 cashpw/-schedule-pomodoro-six '(:start "14:00" :end "14:50")
 cashpw/-schedule-pomodoro-seven '(:start "15:00" :end "15:50")
 cashpw/-schedule-pomodoro-eight '(:start "16:00" :end "16:50")
 cashpw/-schedule-pomodoro-nine '(:start "17:00" :end "17:50")
 cashpw/-schedule-pomodoro-ten '(:start "18:00" :end "18:50"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-schedule-at-pomodoro (pomodoro-time &optional date)
  (interactive)
  (let ((start-time (plist-get pomodoro-time :start)))
        (date (or date "today")))
    (org-schedule nil (format "%s %s"
                              date
                              start-time)))
#+end_src

