config/doom/config-personal.org
**** Scheduling task in N hours

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-schedule-in-n-hours (offset-hours &optional date)
  (interactive)
  (let* ((time-list (parse-time-string (current-time-string)))
         (current-hour (nth 2 time-list))
         (current-minute (nth 1 time-list))
         (hour (mod (+ current-hour offset-hours) 24))
         (date (or date "today")))
    (org-schedule nil (format "%s %s:%s"
                              date
                              hour
                              current-minute))))
#+end_src

**** Scheduling task in N days

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-schedule-in-n-workdays (num-days &optional time)
  (interactive)
  (let*
      ((time (or time "09:00"))
       (offset-days))
    (org-schedule
     nil
     (format "%s %s"
             offset-days
             time))))
#+end_src

**** Goto most recent timestamp in buffer

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-get-timestamps-in-time-order ()
  "Return a list of timestamps from the current buffer in time order."
  (cl-sort
   (org-element-map
       (org-element-parse-buffer)
       'timestamp
     (lambda (timestamp)
       `(,(org-element-property :raw-value timestamp) . ,(org-element-property :begin timestamp))))
   'org-time>
   :key 'car))

(defun cashpw/org-goto-most-recent-timestamp ()
  "`goto-char' the most recent timestamp in the current buffer."
  (interactive)
  (let ((timestamps
         (cashpw/org-get-timestamps-in-time-order)))
    (goto-char
     (cdr
      (pop timestamps)))))

(defun cashpw/org-goto-most-recent-timestamp-with-property (property)
  "`goto-char' the most recent timestamp in the current buffer with a non-nil value for the provided property."
  (interactive)
  (let ((timestamps
         (cashpw/org-get-timestamps-in-time-order)))
    (goto-char
     (cdr
      (pop timestamps)))
    (while (and timestamps
                (not
                 (org-entry-get
                  (point)
                  property)))
      (goto-char
       (cdr
        (pop timestamps))))))
#+end_src

**** Edit FILETAGS

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-mode-set-filetag (value)
   "Add another option; requires at least one option to already be present."
  (message "---")
  (goto-char
   (point-min))
  (if (search-forward-regexp
       "#\\+\\(FILETAGS\\|filetags\\): "
       ;; bound
       nil
       ;; noerror
       t)
      (progn
        (end-of-line)
        (insert (format "%s:" value)))
    (progn
      ;; Add filetags beneath the title; assumes there is a title
      (goto-char
       (point-min))
      (when (search-forward-regexp
          "^#\\+\\(TITLE\\|title\\):")
        (end-of-line)
        (newline)
        (cashpw/org-mode-insert-option
         "FILETAGS"
         (format ":%s:"
                 value))))))

(defun cashpw/org-mode-insert-option (option value)
  "Insert an org-mode option (#+OPTION: VALUE)."
  (insert
   (format
    "#+%s: %s\n"
    option
    value)))
#+end_src

**** Removing RESULT blocks

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-remove-all-results-blocks ()
  "Removes all result blocks; basically an alias"
  (interactive)
  (org-babel-remove-result-one-or-many t))
#+end_src
**** Test for presence of tag

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-mode--has-tag-p (tag)
  "Return t if TAG is a member of the tags of the entry at point."
  (member
   tag
   (org-get-tags)))
#+end_src


**** =cashpw/diary-last-day-of-month=

#+begin_src emacs-lisp :tangle config-personal.el
;;; ORG-MODE:  * My Task
;;;              SCHEDULED: <%%(diary-last-day-of-month date)>
;;; DIARY:  %%(diary-last-day-of-month date) Last Day of the Month
;;; See also:  (setq org-agenda-include-diary t)
;;; (diary-last-day-of-month '(2 28 2017))
;;; Reference: https://emacs.stackexchange.com/a/31708
(defun cashpw/diary-last-day-of-month (date)
  "Return `t` if DATE is the last day of the month."
  (let* ((day (calendar-extract-day date))
         (month (calendar-extract-month date))
         (year (calendar-extract-year date))
         (last-day-of-month
          (calendar-last-day-of-month month year)))
    (= day 30)
    ;; (= day last-day-of-month)
    ))
#+end_src

**** =cashpw/org-set-last-modified=
#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-set-last-modified ()
  (interactive)
  (when (derived-mode-p 'org-mode)
    (save-excursion
      (goto-char (point-min))
      (org-set-property "LAST_MODIFIED"
                        (cashpw/format-time "[%Y-%m-%d %a %H:%M]")))))
#+end_src

**** Properties

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-mode-insert-property (property value)
  "Insert an org-mode property (:PROPERTY: VALUE)."
  (insert (s-lex-format
           ":${property}: ${value}\n")))
#+end_src

**** =cashpw/org-mode-get-description-from-link-at-point=

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-mode-get-description-from-link-at-point ()
  "Reference: https://emacs.stackexchange.com/a/38297"
  (interactive)
  (let ((link
         (org-element-context)))
    (message
     "%s"
     (buffer-substring-no-properties
      (org-element-property
       :contents-begin
       link)
      (org-element-property
       :contents-end
       link)))))
#+end_src

**** Priorities

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/is-valid-priority-p (priority)
  "Return nil if the provided PRIORITY is not valid."
  (or
   (string= "0" priority)
   (string= "1" priority)
   (string= "2" priority)
   (string= "3" priority)
   (string= "4" priority)))
#+end_src

*** Lint

Use [[github:/amperser/proselint][Proselint]].

#+begin_src emacs-lisp :tangle config-personal.el
;; (after! flycheck
;;   :config
;;   (flycheck-reset-enabled-checker 'proselint))
#+end_src

*** Appearance
#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  (setq
   org-ellipsis " ▾"
   org-hide-leading-stars t))
#+end_src

*** Behavior

#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  (setq org-refile-targets '((nil :maxlevel . 9)
                             (org-agenda-files :maxlevel . 9))
        ;; showeverything to make large files open faster
        org-startup-folded 'showeverything
        org-log-into-drawer t
        org-log-repeat t))
#+end_src

**** TODOs

***** Priorities

I use a numeric scale for priorities rather than the default =A= through =C=.

#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  :config
  (setq
   org-priority-highest 0
   org-priority-default 2
   org-priority-lowest 4))
#+end_src

***** Keywords

#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  :config
  (setq
   org-todo-keywords
   '((sequence
      ;; A task that needs doing & is ready to do
      "TODO(t)"
      ;; A task that is in progress
      "INPROGRESS(i)"
      ;; Something external is holding up this task
      "BLOCKED(b)"
      ;; This task is paused/on hold because of me
      "HOLD(h)"
      ;; A project, which usually contains other tasks
      "PROJ(p)"
      "|"
      ;; Task successfully completed
      "DONE(d)"
      ;; Task was moved
      "MOVE(m)"
      ;; Task was cancelled, aborted or is no longer applicable
      "KILL(k)")
     (sequence
      ;; A task that needs doing
      "[ ](T)"
      ;; Task is in progress
      "[-](S)"
      ;; Task is being held up or paused
      "[?](W)"
      "|"
      ;; Task was completed
      "[X](D)"))
   org-todo-keyword-faces
   '(("[-]"  . +org-todo-active)
     ("INPROGRESS" . +org-todo-active)
     ("[?]"  . +org-todo-onhold)
     ("BLOCKED" . +org-todo-onhold)
     ("HOLD" . +org-todo-onhold)
     ("PROJ" . +org-todo-project))))
#+end_src

***** When marking a heading as ...

Save the buffer whenever I make change the state of a todo item. Note: The buffer [[https://emacs.stackexchange.com/questions/55899/how-to-save-a-org-buffer-everytime-the-todo-state-changes#comment87667_55900][will appear modified even after running this snippet]].

#+begin_src emacs-lisp :tangle config-personal.el
;; (after! org
;;   (add-hook!
;;    'org-after-todo-state-change-hook
;;    'save-buffer))
#+end_src

