config/doom/config-personal.org
****** =INPROGRESS=

#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashpw/org-mode--inprogress-clock-in-paths
  nil
  "TODOs marked as INPROGRESS in these files will trigger a clock in.")

(defun cashpw/org-mode--inprogress-in-clock-in-file-p ()
  (member
   buffer-file-name
   cashpw/org-mode--inprogress-clock-in-paths))

(defun cashpw/org-mode-when-inprogress ()
  "Handle inprogress behavior."
  (when (string-equal (org-get-todo-state)
                       "INPROGRESS")
    (cond
     ((cashpw/org-mode--inprogress-in-clock-in-file-p)
      (org-clock-in)))))

(after! org
  :config
  (setq
   cashpw/org-mode--inprogress-clock-in-paths
   '("/home/cashweaver/proj/notes-personal/todos.org"))
  (add-hook!
   'org-after-todo-state-change-hook
   'cashpw/org-mode-when-inprogress))
#+end_src

****** Done

Record the current time when marking a heading as done.

#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  :config
  (setq
   org-log-done 'time))
#+end_src

There are three types of actions which can occur when I mark a TODO item as done. They have a precedence and I've listed them in that order.

1. =noop=: The item remains in the same file; nothing happens other than the todo state changing.
2. =cut=: Delete the item.
2. =archive= (default action): Delete and archive the item.

The return value of hooks determine the action we take. All =noop= hooks must return nil before we consider cutting the entry. Likewise, all =cut= hooks must return nil before we archive the entry.

#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashpw/org-mode-done-noop-hook
  nil
  "Functions which are non-nil when we should noop the TODO at point."
  :type 'hook)

(defcustom cashpw/org-mode-done-cut-hook
  nil
  "Functions which are non-nil when we should cut the TODO at point."
  :type 'hook)
#+end_src

******* Tag

******** =noop=

#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashpw/org-mode-noop-tag
  "noop"
  "Tag which, when present, indicates that the TODO item should be noop.")

(defun cashpw/org-mode--has-noop-tag-p ()
  (cashpw/org-mode--has-tag-p
   cashpw/org-mode-noop-tag))

(add-hook
 'cashpw/org-mode-done-noop-hook
 'cashpw/org-mode--has-noop-tag-p)
#+end_src

******** =cut=

#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashpw/org-mode-cut-tag
  "cut"
  "Tag which, when present, indicates that the TODO item should be cut.")

(defun cashpw/org-mode--has-cut-tag-p ()
  (cashpw/org-mode--has-tag-p
   cashpw/org-mode-cut-tag))

(add-hook
 'cashpw/org-mode-done-cut-hook
 'cashpw/org-mode--has-cut-tag-p)
#+end_src

******* File

******** =noop=
#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashpw/org-mode--done-noop-file-paths
  (append
   '()
   (cashpw/directory-files--org (s-lex-format "${cashpw/home-dir-path}/proj/people")))
  "TODOs in these files will be noop by default.")

(defun cashpw/org-mode--done-in-noop-file-p ()
  (member
   buffer-file-name
   cashpw/org-mode--done-noop-file-paths))

(add-hook
 'cashpw/org-mode-done-noop-hook
 'cashpw/org-mode--done-in-noop-file-p)
#+end_src

******** =cut=
#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashpw/org-mode--done-cut-file-paths
  nil
  "TODOs in these files will be cut by default.")

(defun cashpw/org-mode--done-in-cut-file-p ()
  (member
   buffer-file-name
   cashpw/org-mode--done-cut-file-paths))

(add-hook
 'cashpw/org-mode-done-cut-hook
 'cashpw/org-mode--done-in-cut-file-p)
#+end_src

******* State
******** Repeating

#+begin_src emacs-lisp :tangle config-personal.el
(add-hook
 'cashpw/org-mode-done-noop-hook
 (lambda ()
   (org-get-repeat)))
#+end_src
******** =KILL=

#+begin_src emacs-lisp :tangle config-personal.el
(add-hook
 'cashpw/org-mode-done-cut-hook
 (lambda ()
   (string=
    org-state
    "KILL")))
#+end_src

******* Install hooks

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-mode--should-noop-todo-when-done-p ()
  "Return non-nil if we should noop the current entry."
  (-any
   'funcall
   cashpw/org-mode-done-noop-hook))

(defun cashpw/org-mode--should-cut-todo-when-done-p ()
  "Return non-nil if we should cut the current entry."
  (-any
   'funcall
   cashpw/org-mode-done-cut-hook))

(defun cashpw/org-mode-when-done ()
  "Archive entry when it is marked as done (as defined by `org-done-keywords')."
  (when (org-entry-is-done-p)
    (org-clock-out-if-current)
    (cond
     ((cashpw/org-mode--should-noop-todo-when-done-p)
      nil)
     ((cashpw/org-mode--should-cut-todo-when-done-p)
      (org-cut-subtree))
     (t
      (org-archive-subtree-default)))))

(after! org
  :config
  (add-hook! 'org-after-todo-state-change-hook
             'cashpw/org-mode-when-done))
#+end_src

**** Blocks
:PROPERTIES:
:ID:       ce915eb8-d352-4aa2-9dca-5ada71fd18e1
:END:

#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  :config
  (setq
   org-structure-template-alist
   '(("a" . "export ascii")
     ("c" . "center")
     ("C" . "comment")
     ("e" . "example")
     ("E" . "export")
     ("Eh" . "export html")
     ("El" . "export latex")
     ("q" . "quote")
     ("s" . "src")
     ("sd" . "src dot :file TODO.png :cmdline -Kdot -Tpng")
     ("se" . "src emacs-lisp")
     ("sc" . "src C++")
     ("sp" . "src python :results output")
     ("ss" . "src sh :results output")
     ("v" . "verse"))))
#+end_src

