config/doom/config-personal.el

(defun cashpw/org-agenda-buganizer-title ()
  "Overridden in my work config."
  "")

(defun cashpw/org-agenda-files--people ()
  "Return a list of all people files at DIR-PATH."
  (cashpw/directory-files--org
   (s-lex-format "${cashpw/home-dir-path}/proj/people")))

(defun cashpw/org-agenda-files--notes-personal ()
  "Return a list of all personal notes files at DIR-PATH."
  (cashpw/directory-files--org
   (s-lex-format "${cashpw/home-dir-path}/proj/notes-personal")))

;; TODO Speed up by pre-computing
(defun cashpw/org-agenda-files--notes-private ()
  "Return a list of all private notes files at DIR-PATH."
  (cashpw/directory-files--org
   (s-lex-format "${cashpw/home-dir-path}/proj/notes-private")))

;; TODO Speed up by pre-computing
(defun cashpw/org-agenda-files--notes ()
  "Return a list of all private notes files at DIR-PATH."
  (let* ((org-roam-directory (s-lex-format "${cashpw/home-dir-path}/proj/notes"))
         (files-to-ignore `(,(s-lex-format "${org-roam-directory}/unread.org")
                            ,(s-lex-format "${org-roam-directory}/todos.org"))))
    (seq-difference (cashpw/org-roam-todo-files)
                    files-to-ignore)))

(defun cashpw/org-agenda-files--notes-private ()
  "Return a list of all private notes files at DIR-PATH."
  (let ((org-roam-directory (s-lex-format "${cashpw/home-dir-path}/proj/notes-private")))
    (cashpw/org-roam-todo-files)))

(defun cashpw/org-agenda-files--update ()
  "Update `org-agenda-files' and related variables."
  (interactive)
  (setq
   cashpw/org-agenda-files--people (cashpw/org-agenda-files--people)
   cashpw/org-agenda-files--notes-personal (cashpw/org-agenda-files--notes-personal)
   org-agenda-files (append
                     cashpw/org-agenda-files--people
                     cashpw/org-agenda-files--notes-personal)))
(cashpw/org-agenda-files--update)

(use-package! org-agenda)
(use-package! evil-org-agenda)
(use-package! org-super-agenda
  :demand t
  :after (:all org-agenda
               evil
               evil-org-agenda)
  :hook ((org-agenda-mode . org-super-agenda-mode))
  :config
  (setq
   ;; TODO: Move this variable
   cashpw/roam-dir-path (s-lex-format
                         "${cashpw/home-dir-path}/proj/notes")
   cashpw/roam-unread-file-path (s-lex-format
                                 "${cashpw/roam-dir-path}/unread.org")
   org-agenda-prefix-format '((agenda . " %i %-20(cashpw/org-agenda-category)%?-12t%-6e% s")
                              (todo . " %i %-20(cashpw/org-agenda-category) %-6e %-40(cashpw/org-agenda-buganizer-title)")
                              (tags . " %i %-12c")
                              (search . " %i %-12c"))
   org-super-agenda-header-map evil-org-agenda-mode-map
   ;; https://emacs.stackexchange.com/a/17128
   org-agenda-sorting-strategy '((agenda time-up priority-down category-keep)
                                 (todo priority-down category-keep)
                                 (tags priority-down category-keep)
                                 (search category-keep))
   org-agenda-custom-commands `(("c" "Super view"
                                 ((agenda "" ((org-agenda-overriding-header "")
                                        ;(org-agenda-files cashpw/org-agenda-files--without-roam)
                                              (org-agenda-dim-blocked-tasks nil)
                                              (org-agenda-use-tag-inheritance nil)
                                              (org-super-agenda-groups
                                               '((:name "Schedule"
                                                  :time-grid t)
                                                 (:name "Scheduled/Due Today"
                                                  :scheduled today
                                                  :deadline today)
                                                 (:discard
                                                  (:tag "habit"
                                                   :tag "repeating"))
                                                 (:name "Overdue"
                                                  :scheduled past
                                                  :deadline past)
                                                 (;; Toss all other todos
                                                  :discard
                                                  (:todo t))))))
                                  (alltodo "" ((org-agenda-overriding-header "")
                                        ;(org-agenda-files cashpw/org-agenda-files--without-roam)
                                               (org-agenda-dim-blocked-tasks nil)
                                               (org-agenda-use-tag-inheritance nil)
                                               (org-super-agenda-groups
                                                '((;; Automatically named "Log"
                                                   :log t)
                                                  (;; PROJ items group actionable TODOs; ignore them.
                                                   :discard
                                                   (:todo "PROJ"))
                                                  (:name "In Progress"
                                                   :todo "INPROGRESS")
                                                  (:discard
                                                   (:tag "repeating"))
                                                  (;; Toss all tasks scheduled for or due in the past.
                                                   :discard
                                                   (:scheduled past
                                                    :deadline past))
                                                  (;; Toss all tasks scheduled for or due today.
                                                   :discard
                                                   (:scheduled today
                                                    :deadline today))
                                                  (;; Toss all tasks scheduled for or due in the future.
                                                   :discard
                                                   (:scheduled future
                                                    :deadline future))
                                                  (;; Group by priority
                                                   :auto-map
                                                   (lambda (item)
                                                     (-when-let* ((marker
                                                                   (or (get-text-property 0 'org-marker item)
                                                                       (get-text-property 0 'org-hd-marker)))
                                                                  (priority
                                                                   (org-entry-get
                                                                    marker
                                                                    "PRIORITY")))
                                                       (s-lex-format
                                                        "p${priority}"))))))))))

                                ("h" "Habits"
                                 ((agenda "" ((org-agenda-overriding-header "")
                                        ;(org-agenda-files cashpw/org-agenda-files--without-roam)
                                              (org-agenda-dim-blocked-tasks nil)
                                              (org-agenda-use-tag-inheritance nil)
                                              (org-habit-show-all-today t)
                                              (org-super-agenda-groups
                                               '((;; Automatically named "Log"
                                                  :log t)
                                                 (:name "People"
                                                  :and (:habit t :file-path "proj\\/people"))
                                                 (:name "Habits"
                                                  :habit)
                                                 (;; Toss all other todos
                                                  :discard
                                                  (:todo t))
                                                 ))))))
                                ("r" "Roam"
                                 ((alltodo "" ((org-agenda-overriding-header "")
                                               ;; Speed up
                                               (org-agenda-dim-blocked-tasks nil)
                                               (org-agenda-inhibit-startup t)
                                               (org-agenda-use-tag-inheritance nil)
                                               (org-agenda-ignore-properties '(effort appt category stats))
                                               ;; TODO Speed up by pre-computing
                                               (org-agenda-files (append (cashpw/org-agenda-files--notes)
                                                                         (cashpw/org-agenda-files--notes-private)))
                                               (org-super-agenda-groups
                                                `((:name "In Progress"
                                                   :todo "INPROGRESS")
                                                  ,(cashpw/org-super-agenda--group-by-priority)
                                                  ;; (:name "Todos"
                                                  ;;  :todo t)
                                                  ))))))
                                ("R"
                                 "Roam Unread"
                                 ((alltodo "" ((org-agenda-overriding-header "")
                                               (org-agenda-files `(,cashpw/roam-unread-file-path))
                                               (org-agenda-dim-blocked-tasks nil)
                                               (org-super-agenda-groups
                                                `(
                                                  (:name "essay (10)"
                                                   :take (10 (:and
                                                              (:tag "essay"
                                                               :not (:tag "someday"
                                                                     :tag "link_group")))))
                                                  ,(cashpw/org-super-agenda--roam-group
                                                    "discussion"
                                                    10)
                                                  ,(cashpw/org-super-agenda--roam-group
                                                    "book"
                                                    10)
                                                  ,(cashpw/org-super-agenda--roam-group
                                                    "link_group"
                                                    10)
                                                  ,(cashpw/org-super-agenda--roam-group
                                                    "class"
                                                    10)
                                                  (:name "someday (10)"
                                                   :take (10 (:and (:tag "someday"))))

                                                  (:discard
                                                   (:todo t)
                                                   )))))))))
  (defun cashpw/org-agenda-category ()
    (or (org-get-category)
        ""))

  (cl-defun org-super-agenda--group-dispatch-take (items (n group))
    ;;(cl-defun org-super-agenda--group-dispatch-take (items n-and-group)
    "Take N ITEMS that match selectors in GROUP.
If N is positive, take the first N items, otherwise take the last N items.
Note: the ordering of entries is not guaranteed to be preserved, so this may
not always show the expected results."
    (message (format "%s" group))
    (-let* (((name non-matching matching) (org-super-agenda--group-dispatch items group))
            (take-fn (if (cl-minusp n) #'-take-last #'-take))
            (placement (if (cl-minusp n) "Last" "First"))
            (name (format "%s %d %s" placement (abs n) name)))
      (list name non-matching (funcall take-fn (abs n) matching)))))

(defun cashpw/org-super-agenda--group-by-priority ()
  "Group by my priorities (e.g. p0 through p4)."
  '(:auto-map
    (lambda (item)
      (-when-let* ((marker (or (get-text-property 0 'org-marker item)
                               (get-text-property 0 'org-hd-marker)))
                   (priority (org-entry-get
                              marker
                              "PRIORITY")))
        (if (string= priority "")
            "unknown"
          (s-lex-format
           "p${priority}")
          )))))

(defun cashpw/org-super-agenda--roam-group (tag take)
  "Return a plist TODO."
  `(:name ,(format "%s (%d)"
                   tag
                   take)
    :take (,take
           (:and
            (:tag ,tag
             :not (:tag "someday"))))))

(after! org
  :config
  (setq
   calendar-week-start-day 1
   org-agenda-entry-text-maxlines 30
   org-agenda-entry-text-leaders "  "
   org-agenda-time-grid '((daily
                           today
                           require-timed
                           remove-match)
                          (800 900 1000 1100 1200 1300 1400 1500 1600 1700)
                          ;; (800 1000 1200 1400 1600 1800 2000)
                          "......" "----------------")
   ))

(defun cashpw/org-mode-buffer-property-get (property-name)
  (org-with-point-at 1
    (when (re-search-forward
           (concat "^#\\+" property-name ": \\(.*\\)")
           (point-max) t)
      (buffer-substring-no-properties
       (match-beginning 1)
       (match-end 1)))))

(after! org-agenda
  (setq
   org-duration-units `(("m" . 1)
                        ("min" . 1)
                        ("mins" . 1)
                        ("h" . 60)
                        ("d" . ,(* 60 24))
                        ("w" . ,(* 60 24 7))
                        ("mo" . ,(* 60 24 30))
                        ("mos" . ,(* 60 24 30))
                        ("M" . ,(* 60 24 30))
                        ("y" . ,(* 60 24 365.25)))
   org-agenda-skip-scheduled-if-deadline-is-shown t
   org-agenda-skip-scheduled-if-done t
   org-agenda-skip-scheduled-if-done t
   org-agenda-skip-deadline-if-done t
   org-agenda-include-deadlines t
   org-agenda-block-separator nil
   org-agenda-compact-blocks t
   org-agenda-start-day nil ;; i.e. today
   org-agenda-span 3
   org-agenda-include-diary t
   org-agenda-start-on-weekday nil))
