config/doom/config-personal.org
**** Effort
#+begin_src emacs-lisp
(setq
 cashpw/org-agenda--max-effort "6:00")

(defun cashpw/org-agenda-calculate-efforts (limit)
  "Sum the efforts of scheduled entries up to LIMIT in the
agenda buffer.

Reference: https://emacs.stackexchange.com/a/52376"
  (let (total)
    (save-excursion
      (while (< (point) limit)
        (push (org-entry-get (org-get-at-bol 'org-hd-marker)
                             "Effort")
              total)
        ;; Include unscheduled items in the calculation
        ;; (when (member (org-get-at-bol 'type)
        ;;               '("scheduled" "past-scheduled"))
        ;;   (push (org-entry-get (org-get-at-bol 'org-hd-marker)
        ;;                        "Effort")
        ;;         total))
        (forward-line)))
    (org-duration-from-minutes
     (cl-reduce #'+
                (mapcar #'org-duration-to-minutes
                        (cl-remove-if-not 'identity total))))))

(defun cashpw/org-agenda-insert-efforts ()
  "Insert the efforts for each day inside the agenda buffer.

Reference: https://emacs.stackexchange.com/a/52376 "
  (save-excursion
    (let (pos)
      (while (setq pos (text-property-any
                        (point) (point-max) 'org-agenda-date-header t))
        (goto-char pos)
        (end-of-line)
        (let* ((effort (cashpw/org-agenda-calculate-efforts
                        (next-single-property-change (point) 'day)))
               (effort-text (s-lex-format " (${effort} / ${cashpw/org-agenda--max-effort})")))
          (insert-and-inherit effort-text))
        (forward-line)))))

(add-hook 'org-agenda-finalize-hook 'cashpw/org-agenda-insert-efforts)
#+end_src

*** Clocktable
#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-clock--agenda-with-archives ()
   (cashpw/org-agenda-files t))

(defun cashpw/org-clock--update-clocktable-default-properties ()
  (setq
   org-clock-clocktable-default-properties `(:scope cashpw/org-clock--agenda-with-archives
                                             :block ,(format-time-string "%Y-%m-%d")
                                             :narrow 200
                                             :fileskip0 t
                                             :filetitle t)))

(cashpw/org-clock--update-clocktable-default-properties)
(let ((seconds-in-day (* 60 60 24)))
  (cancel-function-timers #'cashpw/org-clock--update-clocktable-default-properties)
  (run-at-time "00:00"
               seconds-in-day
               #'cashpw/org-clock--update-clocktable-default-properties))
#+end_src

*** Notes

**** Roam

I use =org-roam= for [[github:cashpw/roam][general]] and private notes. Each roam directory contains a =.dir-locals.el= file which configures things like capture templates and =before-save-hook=.
***** Helper functions
****** Tags
#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-roam--get-filetags ()
  "Return a list of all tags used in roam."
  (org-roam-db-query [:select
                      :distinct tag
                      :from tags]))

(defun cashpw/org-roam--get-filetags-not-in-node (node-id)
  "Return a list of all tags used in roam, excluding those used in NODE-ID."
  (org-roam-db-query [:select
                      :distinct [tag]
                      :from tags
                      :where tag :not-in [:select tag
                                          :from tags
                                          :where (= node_id $s1)]]
                     node-id))

(defun cashpw/org-roam-set-filetag ()
  "Set the filetag option based on org-roam tags."
  (interactive)
  (when (org-roam-file-p)
    (let* ((current-node-id (org-roam-node-id
                             (org-roam-node-at-point)))
           (tag (completing-read "Select tag: "
                                 (cashpw/org-roam--get-filetags-not-in-node
                                  current-node-id))))
      (cashpw/org-mode-set-filetag tag))))
#+end_src
****** File(path)

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-roam-make-filepath (title &optional time time-zone)
  "Return a filenaem for an org-roam node.

Reference: https://ag91.github.io/blog/2020/11/12/write-org-roam-notes-via-elisp"
  (let ((slug
         (org-roam-node-slug
          (org-roam-node-create
           :title title))))
    (format
     "%s/%s.org"
     org-roam-directory
     slug)))
#+end_src
****** =org-mode= file options
#+begin_src emacs-lisp :tangle config-personal.el

(defun cashpw/org-mode-add-option (option value)
  "Add another option; requires at least one option to already be present.

TODO: move to org-mode section"
  (goto-char
   (point-max))
  (insert "foo")
  (when (search-backward-regexp
         "#\\+[A-Za-z_]+:"
         ;; bound
         nil
         ;; noerror
         t)
    (cashpw/org-mode-insert-option
     option
     value)))

(defun cashpw/org-mode-insert-option (option value)
  "Insert an org-mode option (#+OPTION: VALUE).

TODO: move to org-mode section"
  (insert (s-lex-format "#+${option}: ${value}\n")))

(defun cashpw/org-mode-insert-options (options)
  "Insert an alist of org-mode options (#+OPTION: VALUE)."
  (cl-loop for (option . value) in options
           do (cashpw/org-mode-insert-option
               option
               value)))


#+end_src
****** =org-mode= file properties
#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-mode-insert-properties (properties)
  "Insert an alist of org-mode properties (:PROPERTY: VALUE).

When WRAP is non-nil: Wrap the properties with :PROPERTIES:/:END:."
  (interactive)
  (cl-loop for (property . value) in properties
           do (org-set-property
               property
               value)))
#+end_src

****** Citations
#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-roam-add-citation-as-ref ()
  "Based on `citar-org-roam-ref-add."
  (interactive)
  (let ((citation (with-temp-buffer
                    (org-cite-insert nil)
                    (buffer-string))))
    (org-roam-ref-add citation)))
#+end_src

****** Export
#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-hugo-export-wim-to-md ()
  "Function for `after-save-hook' to run `org-hugo-export-wim-to-md'.

The exporting happens only when Org Capture is not in progress."
  (interactive)
  (when (and (not (eq real-this-command
                      'org-capture-finalize))
             (not (member (buffer-file-name)
                          cashpw/org-roam--file-path-exceptions-to-export-after-save)))
    (save-excursion
      (let* ((org-id-extra-files (org-roam-list-files))
             (export-file-path (org-hugo-export-wim-to-md)))
        (when cashpw/org-hugo-replace-front-matter-with-title
          (with-current-buffer
              (find-file-noselect
               export-file-path)
            (cashpw/replace-toml-front-matter-with-md-heading)
            (save-buffer)))))))
#+end_src

****** New nodes

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-roam-new-node (file-path title &optional properties)
  "Build a new org-roam node in a temp file.

PROPERTIES is expected to be an alist of additional properties to include.

Reference: https://ag91.github.io/blog/2020/11/12/write-org-roam-notes-via-elisp"
  (let* ((id (org-id-new))
         (created-date (cashpw/format-time
                        "[%Y-%m-%d %a %H:%M]"))
         (all-properties (append
                          `(("ID" . ,id))
                          properties)))
    (with-temp-file file-path
      (goto-char (point-min))
      (insert (s-lex-format ":PROPERTIES:\n:ID: ${id}\n:END:\n"))
      (if properties
          (cashpw/org-mode-insert-properties all-properties))
      (goto-char (point-max))
      (cashpw/org-mode-insert-options
       `(("title" . ,title)
         ("author" . "Cash Weaver")
         ("date" . ,created-date)))
      )))

(defun cashpw/org-roam-new-node-from-link-heading-at-point (&optional mark-as-done)
  "Build a new org-roam node from the link heading at point."
  (interactive)
  (let* ((link (org-element-context))
         (type (org-element-property
                :type
                link))
         (url (org-element-property
               :raw-link
               link))
         (description (cashpw/org-mode-get-description-from-link-at-point))
         (org-roam-node-file-path (cashpw/org-roam-make-filepath
                                   description)))
    ;; TODO Replace with regexp?
    (unless (or (string= type "http")
                (string= type "https")))
    (cashpw/org-roam-new-node org-roam-node-file-path
                                  description)
    (if mark-as-done
        (org-todo "DONE"))
    (find-file org-roam-node-file-path)
    (goto-char (point-max))
    (insert "\n")
    (insert (s-lex-format "${url}\n"))
      (org-insert-heading)
      (insert "TODO Summary")
      (org-insert-heading)
      (insert "TODO Notes")
      (org-insert-heading)
      (insert "TODO Thoughts")
    ))
#+end_src



