config/doom/config-personal.el

(defun cashpw/org-clock--agenda-with-archives ()
   (cashpw/org-agenda-files t))

(defun cashpw/org-clock--update-clocktable-default-properties ()
  (setq
   org-clock-clocktable-default-properties `(:scope cashpw/org-clock--agenda-with-archives
                                             :block ,(format-time-string "%Y-%m-%d")
                                             :narrow 200
                                             :fileskip0 t
                                             :filetitle t)))

(cashpw/org-clock--update-clocktable-default-properties)
(let ((seconds-in-day (* 60 60 24)))
  (cancel-function-timers #'cashpw/org-clock--update-clocktable-default-properties)
  (run-at-time "00:00"
               seconds-in-day
               #'cashpw/org-clock--update-clocktable-default-properties))

(defun cashpw/org-roam--get-filetags ()
  "Return a list of all tags used in roam."
  (org-roam-db-query [:select
                      :distinct tag
                      :from tags]))

(defun cashpw/org-roam--get-filetags-not-in-node (node-id)
  "Return a list of all tags used in roam, excluding those used in NODE-ID."
  (org-roam-db-query [:select
                      :distinct [tag]
                      :from tags
                      :where tag :not-in [:select tag
                                          :from tags
                                          :where (= node_id $s1)]]
                     node-id))

(defun cashpw/org-roam-set-filetag ()
  "Set the filetag option based on org-roam tags."
  (interactive)
  (when (org-roam-file-p)
    (let* ((current-node-id (org-roam-node-id
                             (org-roam-node-at-point)))
           (tag (completing-read "Select tag: "
                                 (cashpw/org-roam--get-filetags-not-in-node
                                  current-node-id))))
      (cashpw/org-mode-set-filetag tag))))

(defun cashpw/org-roam-make-filepath (title &optional time time-zone)
  "Return a filenaem for an org-roam node.

Reference: https://ag91.github.io/blog/2020/11/12/write-org-roam-notes-via-elisp"
  (let ((slug
         (org-roam-node-slug
          (org-roam-node-create
           :title title))))
    (format
     "%s/%s.org"
     org-roam-directory
     slug)))

(defun cashpw/org-mode-add-option (option value)
  "Add another option; requires at least one option to already be present.

TODO: move to org-mode section"
  (goto-char
   (point-max))
  (insert "foo")
  (when (search-backward-regexp
         "#\\+[A-Za-z_]+:"
         ;; bound
         nil
         ;; noerror
         t)
    (cashpw/org-mode-insert-option
     option
     value)))

(defun cashpw/org-mode-insert-option (option value)
  "Insert an org-mode option (#+OPTION: VALUE).

TODO: move to org-mode section"
  (insert (s-lex-format "#+${option}: ${value}\n")))

(defun cashpw/org-mode-insert-options (options)
  "Insert an alist of org-mode options (#+OPTION: VALUE)."
  (cl-loop for (option . value) in options
           do (cashpw/org-mode-insert-option
               option
               value)))

(defun cashpw/org-mode-insert-properties (properties)
  "Insert an alist of org-mode properties (:PROPERTY: VALUE).

When WRAP is non-nil: Wrap the properties with :PROPERTIES:/:END:."
  (interactive)
  (cl-loop for (property . value) in properties
           do (org-set-property
               property
               value)))

(defun cashpw/org-roam-add-citation-as-ref ()
  "Based on `citar-org-roam-ref-add."
  (interactive)
  (let ((citation (with-temp-buffer
                    (org-cite-insert nil)
                    (buffer-string))))
    (org-roam-ref-add citation)))

(defun cashpw/org-hugo-export-wim-to-md ()
  "Function for `after-save-hook' to run `org-hugo-export-wim-to-md'.

The exporting happens only when Org Capture is not in progress."
  (interactive)
  (when (and (not (eq real-this-command
                      'org-capture-finalize))
             (not (member (buffer-file-name)
                          cashpw/org-roam--file-path-exceptions-to-export-after-save)))
    (save-excursion
      (let* ((org-id-extra-files (org-roam-list-files))
             (export-file-path (org-hugo-export-wim-to-md)))
        (when cashpw/org-hugo-replace-front-matter-with-title
          (with-current-buffer
              (find-file-noselect
               export-file-path)
            (cashpw/replace-toml-front-matter-with-md-heading)
            (save-buffer)))))))

(defun cashpw/org-roam-new-node (file-path title &optional properties)
  "Build a new org-roam node in a temp file.

PROPERTIES is expected to be an alist of additional properties to include.

Reference: https://ag91.github.io/blog/2020/11/12/write-org-roam-notes-via-elisp"
  (let* ((id (org-id-new))
         (created-date (cashpw/format-time
                        "[%Y-%m-%d %a %H:%M]"))
         (all-properties (append
                          `(("ID" . ,id))
                          properties)))
    (with-temp-file file-path
      (goto-char (point-min))
      (insert (s-lex-format ":PROPERTIES:\n:ID: ${id}\n:END:\n"))
      (if properties
          (cashpw/org-mode-insert-properties all-properties))
      (goto-char (point-max))
      (cashpw/org-mode-insert-options
       `(("title" . ,title)
         ("author" . "Cash Weaver")
         ("date" . ,created-date)))
      )))

(defun cashpw/org-roam-new-node-from-link-heading-at-point (&optional mark-as-done)
  "Build a new org-roam node from the link heading at point."
  (interactive)
  (let* ((link (org-element-context))
         (type (org-element-property
                :type
                link))
         (url (org-element-property
               :raw-link
               link))
         (description (cashpw/org-mode-get-description-from-link-at-point))
         (org-roam-node-file-path (cashpw/org-roam-make-filepath
                                   description)))
    ;; TODO Replace with regexp?
    (unless (or (string= type "http")
                (string= type "https")))
    (cashpw/org-roam-new-node org-roam-node-file-path
                                  description)
    (if mark-as-done
        (org-todo "DONE"))
    (find-file org-roam-node-file-path)
    (goto-char (point-max))
    (insert "\n")
    (insert (s-lex-format "${url}\n"))
      (org-insert-heading)
      (insert "TODO Summary")
      (org-insert-heading)
      (insert "TODO Notes")
      (org-insert-heading)
      (insert "TODO Thoughts")
    ))
