config/doom/config-personal.org
***** Config

#+begin_src emacs-lisp :tangle config-personal.el

(after! doct-org-roam
  (setq
   ;; Note that I've enumerated the "head" entries, rather than defining them in the "group"
   ;; and specifying the tag with a variable, because this didn't produce the right output.
   ;; I didn't have time to dive in an understand why.
   org-roam-capture-templates (doct-org-roam `((:group "org-roam"
                                                :type plain
                                                :template "%?"
                                                :file "${slug}.org"
                                                :unnarrowed t
                                                :children (("Concept"
                                                            :keys "c"
                                                            :head ("#+title: ${title}"
                                                                   "#+author: Cash Prokop-Weaver"
                                                                   "#+date: [%<%Y-%m-%d %a %H:%M>]"
                                                                   "#+filetags: :concept:"))
                                                           ("Person"
                                                            :keys "p"
                                                            :head ("#+title: ${title}"
                                                                   "#+author: Cash Prokop-Weaver"
                                                                   "#+date: [%<%Y-%m-%d %a %H:%M>]"
                                                                   "#+filetags: :person:"))
                                                           ("Verse"
                                                            :keys "v"
                                                            :head ("#+title: ${title}"
                                                                   "#+author: Cash Prokop-Weaver"
                                                                   "#+date: [%<%Y-%m-%d %a %H:%M>]"
                                                                   "#+filetags: :verse:"))
                                                           ("Quote"
                                                            :keys "u"
                                                            :head ("#+title: ${title}"
                                                                   "#+author: Cash Prokop-Weaver"
                                                                   "#+date: [%<%Y-%m-%d %a %H:%M>]"
                                                                   "#+filetags: :quote:"))
                                                           ("Recipe"
                                                            :keys "r"
                                                            :head ("#+title: ${title}"
                                                                   "#+author: Cash Prokop-Weaver"
                                                                   "#+date: [%<%Y-%m-%d %a %H:%M>]"
                                                                   "#+filetags: %{filetags}"
                                                                   ""
                                                                   "* TODO [#2] Ingredients"
                                                                   "* TODO [#2] Steps"))))))))

(add-hook
 'cashpw/org-mode-done-cut-hook
 'org-roam-file-p)

(defvar cashpw/org-roam--file-path-exceptions-to-export-after-save
  '()
  "List of org-roam file paths which should NOT be exported after they are saved. This list is populated within the particular .dir-local.el files.")

(defvar cashpw/org-roam--file-path-exceptions-to-mirror-refs-to-front-matter
  '()
  "List of org-roam file paths which should NOT have references mirrored to front matter. This list is populated within the particular .dir-local.el files.")

(defun cashpw/org-roam-rewrite-smart-to-ascii ()
  (when (org-roam-file-p)
    (cashpw/replace-smart-quotes-in-buffer)))

(defun cashpw/org-roam-open-ref ()
  "Open the ROAM_REF."
  (interactive)
  (let ((roam-refs (org-entry-get
                    (point)
                    "ROAM_REFS")))
    (message roam-refs)
    (if (s-starts-with-p "http"
                         roam-refs)
        (browse-url roam-refs)
      (message "Not an http(s) ref (%s)"
               roam-refs))))

;; This bit is no longer necessary as I've discovered .dir-locals.el.
;; Setting `org-attach-directory' in .dir-locals.el has the desired
;; effect of this function.
;;
;; (defun cashpw/org-roam-insert-attachment-path ()
;;   (let ((dir
;;          (format
;;           "%s/%s"
;;           cashpw/org-roam-attachment-base-path
;;           (org-id-get))))
;;     (save-excursion
;;       (org-set-property
;;        "DIR"
;;        dir))))
;; (after! org-roam
;;   (remove-hook! 'org-roam-capture-new-node-hook
;;               'cashpw/org-roam-insert-attachment-path))

(defun cashewaver-org-roam--append-to-custom-front-matter (key value)
  "Append the provided KEY and VALUE to hugo_custom_front_matter."
  (when (org-roam-file-p)
    (let
        ((keyword
          "HUGO_CUSTOM_FRONT_MATTER")
         (current-value
          (org-collect-keywords
           keyword)))
      (message current-value)
      (org-roam-set-keyword
       (downcase keyword)
       (format "%s %s"
               key
               value)))))

(defun cashpw/org-roam--mirror-roam-aliases-to-hugo-aliases ()
  "Copy the list of ROAM_ALIASES into HUGO_ALIASES.

Work in progress"
  (interactive)
  (when (org-roam-file-p)
    (when-let*
        ((option
          "HUGO_ALIASES")
         (raw-roam-aliases
          (read (format "(%s)"
                        (org-export-get-node-property
                         :ROAM_ALIASES
                         (org-element-parse-buffer)))))
         (roam-aliases
          (mapcar
           #'downcase
           (mapcar
            (lambda (alias)
              (replace-regexp-in-string
               " "
               "_"
               alias))
            raw-roam-aliases))))
      ;;roam-aliases
      roam-aliases
      )))

;; (cashpw/org-roam--mirror-roam-aliases-to-hugo-aliases)

(defun cashpw/org-roam--mirror-roam-aliases-to-hugo-aliases ()
  "Copy the list of ROAM_ALIASES into HUGO_ALIASES."
  (interactive)
  (when (org-roam-file-p)
    (when-let
        ((option
          "HUGO_ALIASES")
         (raw-roam-aliases
          (org-export-get-node-property
           :ROAM_ALIASES
           (org-element-parse-buffer))))
      (message raw-roam-aliases))))

(defun cashpw/org-roam--process-ref-before-adding-to-front-matter (ref)
  (cond
   ((string-match-p "^\\[cite" ref)
    nil
    ;; (let ((citation
    ;;        (save-excursion
    ;;          (beginning-of-buffer)
    ;;          (search-forward ref)
    ;;          (org-element-citation-parser))))
    ;;   (org-cite-export-citation
    ;;    citation
    ;;    nil
    ;;    '(:cite-export nil)
    ;;    ))
    )
   (t
    ref)))

(defun cashpw/org-hugo--set-custom-front-matter (text)
  (org-roam-set-keyword
   (downcase "HUGO_CUSTOM_FRONT_MATTER")
   text))

(defun cashpw/org-hugo--build-custom-front-matter-from-properties (properties)
  (string-join
   (mapcar
    (lambda (property)
      (goto-char (point-min))
      (let ((key (downcase property))
            (value (org-entry-get (point)
                                  property)))
        (s-lex-format
         ":${key} ${value}")))
    properties)
   " "))

(defun cashpw/org-roam-mirror-roam-refs-to-front-matter ()
  "Copy the list of ROAM_REFS into hugo_custom_front_matter."
  (interactive)
  (when (and (org-roam-file-p)
             (not (member
                   (buffer-file-name)
                   cashpw/org-roam--file-path-exceptions-to-mirror-refs-to-front-matter)))
    (when-let*
        ((keyword "HUGO_CUSTOM_FRONT_MATTER")
         (raw-roam-refs (org-export-get-node-property
                         :ROAM_REFS
                         (org-element-parse-buffer)))
         (refs (split-string
                raw-roam-refs
                " +"))
         (valid-refs (-filter
                      (lambda (ref)
                        (not (string-match-p "^\\[cite" ref)))
                      refs))
         (roam-refs (format
                     "roam_refs '(%s)"
                     (string-join
                      (mapcar
                       (lambda (ref)
                         (format "\"%s\""
                                 ref))
                       valid-refs)
                      " ")))
         (current-roam-refs (or
                             (org-roam-get-keyword
                              keyword)
                             "")))
      (if (not (string=
                roam-refs
                current-roam-refs))
          (org-roam-set-keyword
           (downcase keyword)
           roam-refs)))))

(defun cashpw/citation-present-in-buffer-p ()
  "Return true if a citation is present in the current buffer, nil otherwise."
  (let ((citation-prefix
         "[cite"))
    (save-excursion
      (goto-char
       (point-min))
      (search-forward
       citation-prefix
       ;; bound
       nil
       ;; no-error
       t))))

(defcustom cashpw/org-roam--file-path-exceptions-to-add-bibliography
  '()
  "File paths which will not have a bibliography added by `cashpw/org-roam-add-bibliography'.")

(defun cashpw/org-roam-add-bibliography (&optional skip-if-present)
  "Add #+print_bibiliography to the current buffer."
  (interactive)
  (when (and (org-roam-file-p)
             (not (member (buffer-file-name)
                          cashpw/org-roam--file-path-exceptions-to-add-bibliography))
             (cashpw/citation-present-in-buffer-p))
    (delete-matching-lines "\s*#\\+print_bibliography:$")
    (save-excursion
      (goto-char (point-max))
      (insert "#+print_bibliography:"))))

(defcustom cashpw/org-roam--file-path-exceptions-to-add-flashcards
  '()
  "File paths which won't hold flashcards.")

(defun cashpw/anki-available-p ()
  (condition-case error
      (anki-editor-api-check)
    ('error
     nil))
  t)

(defun cashpw/enable-anki-editor-mode ()
  (if (cashpw/anki-available-p)
      (anki-editor-mode t)
    (message "Skipping enable anki-editor-mode because Anki isn't available.")))

(defun cashpw/anki-editor-push-notes ()
  (if (cashpw/anki-available-p)
      (anki-editor-push-notes)
    (message "Skipping anki-editor-push-notes because Anki isn't available.")))

(defun cashpw/org-roam-add-flashcards (&optional skip-if-present)
  "Add flashcard heading to the current buffer."
  (interactive)
  (let ((skip-if-present (or skip-if-present
                             t))
        (flashcard-header-regexp (rx "*"
                                     (or " TODO"
                                         " INPROGRESS"
                                         "")
                                     (or (and " \[#"
                                              (any "0" "1" "2" "3" "4")
                                              "\]")
                                         "")
                                     " Flashcards"))
        (is-valid-file (and (org-roam-file-p)
                            (not (member (buffer-file-name)
                                         cashpw/org-roam--file-path-exceptions-to-add-flashcards)))))
    (when is-valid-file
      (let* ((flashcard-present-in-buffer (save-excursion
                                            (goto-char (point-min))
                                            (re-search-forward flashcard-header-regexp
                                                               ;; bound
                                                               nil
                                                               ;; noerror
                                                               t))))
        (unless (and skip-if-present
                     flashcard-present-in-buffer)
          (save-excursion
            (goto-char (point-max))
            (org-insert-heading
             ;; arg
             nil
             ;; invisible-ok
             t
             ;; top
             t)
            (insert "TODO [#2] Flashcards")))))))
(defun cashpw/org-roam-insert-tag-link ()
  "Insert a link to the selected tag"
  (interactive)
  (let ((tag
         (completing-read
          "Select tag: "
          (cashpw/org-roam--get-filetags)
          )))
    (insert
     (format "[[/tags/%s][%s]]"
             (downcase
              (nth 0
                   (org-hugo--tag-processing-fn-replace-with-hyphens-maybe
                    `(,tag)
                    `(:hugo-prefer-hyphen-in-tags ,org-hugo-prefer-hyphen-in-tags))))
             tag))))


(defun cashpw/org-roam-node-from-cite--inner (entry title)
  "Create a roam node based on bibliography citation.

See: https://jethrokuan.github.io/org-roam-guide"
  (interactive (list (citar-select-ref)))
  (org-roam-capture- :templates
                     '(("r" "reference" plain "%?" :if-new
                        (file+head "${slug}.org"
                                   ":PROPERTIES:
:ROAM_REFS: [cite:@${citekey}]
:END:
,#+title: ${title}
,#+author: Cash Weaver
,#+date: [%<%Y-%m-%d %a %H:%M>]
,#+filetags: :reference:

TODO_AUTHOR, [cite:@${citekey}]

,* TODO Summary
,* TODO Thoughts
,* TODO Notes")
                        :immediate-finish t
                        :unnarrowed t))
                     :info (list
                            :citekey entry)
                     :node (org-roam-node-create
                            :title title)
                     :props '(:finalize find-file)))
(defun cashpw/format-cited-author-for-org-roam (raw-authors)
  (if (not (s-contains? "," raw-authors))
      raw-authors
    (cond
     (;; e.g. "Doe, Jane and Doe, John"
      (s-contains? " and " raw-authors)
      (s-join " and "
              (mapcar
               (lambda (author)
                 (s-join " " (reverse (s-split ", " author))))
               (s-split " and " raw-authors 'omit-nulls))))
     (;; e.g. "Doe, Jane"
      t
      (s-join " " (reverse (s-split ", " raw-authors 'omit-nulls)))))))

(defun cashpw/org-roam-node-from-cite ()
  "Create a roam node based on bibliography citation.

See: https://jethrokuan.github.io/org-roam-guide"
  (interactive)
  (let* ((entry (citar-select-ref))
         (author (cashpw/format-cited-author-for-org-roam
                  (citar-format--entry (citar-format--parse "${author editor journal}")
                                       entry)))
         (citation-title (citar-format--entry (citar-format--parse "${title}")
                                              entry))
         (default-title (cond
                         ((string-empty-p citation-title)
                          "Something went wrong when extracting the title.")
                         ((string-empty-p author)
                          citation-title)
                         (t
                          (s-lex-format
                           "${author} | ${citation-title}"))))
         (title (read-string "Title:"
                             default-title)))
    (cashpw/org-roam-node-from-cite--inner entry title)))

(defun cashpw/org-roam-before-save ()
  (cashpw/org-roam-rewrite-smart-to-ascii)
  (cashpw/org-roam-mirror-roam-refs-to-front-matter)
  (cashpw/org-roam-add-bibliography)
  (cashpw/org-roam-add-flashcards)
  ;; (cashpw/org-hugo-export-wim-to-md)
  ;; (cashpw/anki-editor-push-notes)
  )
#+end_src

#+RESULTS:
: cashpw/org-roam-before-save

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-hugo-linkify-mathjax (mathjax-post-map)
  (cl-loop for (target . post-id) in mathjax-post-map
           do (save-excursion
                (goto-char (point-min))
                (replace-regexp target
                                (s-lex-format "\\\\href{/posts/${post-id}}{\\1}")))))

(setq
 cashpw/org-hugo--mathjax-post-map '(("\\(C\\\\_{n}\\)" . "centering_matrix")
                                         ("\\(I\\\\_{n}\\)" . "identity_matrix")
                                         ("\\(I\\\\_{[0-9]+}\\)" . "identity_matrix")
                                         ("\\(J\\\\_{[0-9]+}\\)" . "matrix_of_ones")
                                         ("\\(J\\\\_{[0-9]+,[0-9]+}\\)" . "matrix_of_ones")
                                         ("\\(J\\\\_{[0-9]+ \\\\times [0-9]+}\\)" . "matrix_of_ones")
                                         ("\\(\\\\cos\\)" . "cosine")
                                         ("\\(\\\\sin\\)" . "sine")
                                         ("\\(\\\\vert . \\\\vert\\)" . "cardinality")
                                         ("\\(\\\\tan\\)" . "tangent")))

(defun org-hugo--after-1-export-function (info outfile)
  "Function to be run after exporting one post.

The post could be exported using the subtree-based or file-based
method.

This function is called in the end of `org-hugo-export-to-md',
and `org-hugo-export-as-md'.

INFO is a plist used as a communication channel.

OUTFILE is the Org exported file name.

This is an internal function."
  (advice-remove 'org-cite-export-bibliography #'org-hugo--org-cite-export-bibliography)
  (advice-remove 'org-info-export #'org-hugo--org-info-export)
  (advice-remove 'org-babel--string-to-number #'org-hugo--org-babel--string-to-number)
  (advice-remove 'org-babel-exp-code #'org-hugo--org-babel-exp-code)
  (when (and outfile
             (org-hugo--pandoc-citations-enabled-p info))
    (require 'ox-hugo-pandoc-cite)
    (plist-put info :outfile outfile)
    (plist-put info :front-matter org-hugo--fm)
    (org-hugo-pandoc-cite--parse-citations-maybe info))
  (setq org-hugo--fm nil)
  (setq org-hugo--fm-yaml nil)
  (when outfile
    (with-current-buffer
        (find-file-noselect outfile)
      (cashpw/org-hugo-linkify-mathjax cashpw/org-hugo--mathjax-post-map)
      (save-buffer))))
#+end_src

#+begin_src emacs-lisp
(cashpw/org-hugo-export-all
 (format "%s/proj/notes"
         cashpw/home-dir-path))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(defun org-roam-id-complete (&optional initial-input filter-fn sort-fn require-match prompt)
  "Read an `org-roam-node', returning its id.

All args are passed to `org-roam-node-read'."
  (concat
   "id:"
   (org-roam-node-id
    (org-roam-node-read
     initial-input filter-fn sort-fn require-match prompt))))

(org-link-set-parameters "id" :complete #'org-roam-id-complete)

#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(after! org-roam
  (defun org-hugo-export-wim-to-md-after-save ()
    (cashpw/org-hugo-export-wim-to-md))
  (setq
   cashpw/org-hugo-replace-front-matter-with-title nil))
#+end_src


