config/doom/config-personal.org
***** Agenda view
#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/buffer-has-todo-p ()
  "Return non-nil if current buffer has any todo entry.

TODO entries marked as done are ignored, meaning the this
function returns nil if current buffer contains only completed
tasks."
  (seq-find                                 ; (3)
   (lambda (type)
     (eq type 'todo))
   (org-element-map                         ; (2)
       (org-element-parse-buffer 'headline) ; (1)
       'headline
     (lambda (h)
       (org-element-property :todo-type h)))))

(defun cashpw/org-roam-update-todo-tag ()
    "Update HAS_TODO tag in the current buffer."
    (when (and (not (active-minibuffer-window))
               (vulpea-buffer-p))
      (save-excursion
        (goto-char (point-min))
        (let* ((tags (vulpea-buffer-tags-get))
               (original-tags tags))
          (if (cashpw/buffer-has-todo-p)
              (setq tags (cons "has_todo" tags))
            (setq tags (remove "has_todo" tags)))

          ;; cleanup duplicates
          (setq tags (seq-uniq tags))

          ;; update tags if changed
          (when (or (seq-difference tags original-tags)
                    (seq-difference original-tags tags))
            (apply #'vulpea-buffer-tags-set tags))))))

(defun vulpea-buffer-p ()
  "Return non-nil if the currently visited buffer is a note."
  (and buffer-file-name
       (string-prefix-p
        (expand-file-name (file-name-as-directory org-roam-directory))
        (file-name-directory buffer-file-name))))

(defun cashpw/org-roam-todo-files ()
    "Return a list of note files containing 'has_todo tag." ;
    (seq-uniq
     (seq-map
      #'car
      (org-roam-db-query
       [:select [nodes:file]
        :from tags
        :left-join nodes
        :on (= tags:node-id nodes:id)
        :where (like tag (quote "%\"has_todo\"%"))]))))

(defun vulpea-agenda-files-update (&rest _)
  "Update the value of `org-agenda-files'."
  (setq org-agenda-files (cashpw/org-roam-todo-files)))

(add-hook 'find-file-hook #'cashpw/org-roam-update-todo-tag)
(add-hook 'before-save-hook #'cashpw/org-roam-update-todo-tag)
#+end_src

***** Roam UI

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam
  ;; normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;; a hookable mode anymore, you're advised to pick something yourself
  ;; if you don't care about startup time, use
  ;; :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))
#+end_src

***** Export
****** Backlinks

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-export-preprocessor (backend)
  (when (org-roam-file-p)
    (let* ((current-node (org-roam-node-at-point))
           (current-node-file (org-roam-node-file current-node))
           (-compare-fn (lambda (a b)
                          (equal (org-roam-node-id (org-roam-backlink-source-node a))
                                 (org-roam-node-id (org-roam-backlink-source-node b)))))
           (backlinks (-uniq (org-roam-backlinks-get current-node)))
           (backlinks-as-string (--reduce-from
                                 (let* ((source-node (org-roam-backlink-source-node it))
                                        (id (org-roam-node-id source-node))
                                        (file (org-roam-node-file source-node))
                                        (title (org-roam-node-title source-node)))
                                   (if (equal file current-node-file)
                                       acc
                                     (concat acc
                                             (s-lex-format " - [[id:${id}][${title}]]\n"))))
                                 ""
                                 backlinks)))
      (unless (string= backlinks-as-string "")
        (save-excursion
          (goto-char (point-max))
          (insert (concat "\n* Backlinks\n"
                          backlinks-as-string)))))))
(add-hook 'org-export-before-processing-hook 'cashpw/org-export-preprocessor)
#+end_src

**** Annotate PDFs

***** TODO Config

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-noter-insert-selected-text-inside-note-content ()
  "Insert selected text in org-noter note.

Reference: https://github.com/weirdNox/org-noter/issues/88#issuecomment-700346146"
  (interactive)
  (progn
    (setq
     current-buffer-name (buffer-name))
    (org-noter-insert-precise-note)
    (set-buffer current-buffer-name)
    (org-noter-insert-note)))
#+end_src

