config/doom/config-personal.org
*** TODO Capture Templates

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 ;; org-roam
 cashpw/org-roam--capture-template--todo `("Roam"
                                           :keys "r"
                                           :file ,(lambda () (s-lex-format "${org-roam-directory}/todos.org"))
                                           :template ("* TODO [#2] %?"
                                                      ":PROPERTIES:"
                                                      ":CREATED: %U"
                                                      ":END:"))
 ;; org-fc
 cashpw/org-fc--capture-template--normal `("Normal"
                                           :keys "n"
                                           :file ,(lambda () (buffer-name))
                                           :olp ("Flashcards")
                                           :template ("* %^{Name of card}"
                                                      ":PROPERTIES:"
                                                      ":CREATED: %U"
                                                      ":END:"
                                                      ""
                                                      "%?"
                                                      ""
                                                      "** TODO Back"
                                                      "** TODO Source"
                                                      )
                                           :prepare-finalize ,(lambda ()
                                                                (goto-char (point-min))
                                                                (org-fc-type-normal-init)))
 cashpw/org-fc--capture-template--double `("Double"
                                           :keys "d"
                                           :file ,(lambda () (buffer-name))
                                           :olp ("Flashcards")
                                           :template ("* %^{Name of card}"
                                                      ":PROPERTIES:"
                                                      ":CREATED: %U"
                                                      ":END:"
                                                      ""
                                                      "%?"
                                                      ""
                                                      "** TODO Back"
                                                      "** TODO Source"
                                                      )
                                           :prepare-finalize ,(lambda ()
                                                                (goto-char (point-min))
                                                                (org-fc-type-double-init)))
 cashpw/org-fc--capture-template--cloze `("Cloze"
                                          :keys "c"
                                          :file ,(lambda () (buffer-name))
                                          :olp ("Flashcards")
                                          :template ("* %^{Name of card}"
                                                     ":PROPERTIES:"
                                                     ":CREATED: %U"
                                                     ":END:"
                                                     ""
                                                     "%?"
                                                     ""
                                                     "** TODO Source")
                                          :prepare-finalize ,(lambda ()
                                                               (goto-char (point-min))
                                                               (org-fc-type-cloze-init 'deletion)))

 cashpw/org-fc--capture-template--text-input `("Text input"
                                               :keys "t"
                                               :file ,(lambda () (buffer-name))
                                               :olp ("Flashcards")
                                               :template ("* %^{Name of card}"
                                                          ":PROPERTIES:"
                                                          ":CREATED: %U"
                                                          ":END:"
                                                          ""
                                                          "%?"
                                                          ""
                                                          "** TODO Back"
                                                          "** TODO Source")
                                               :prepare-finalize ,(lambda ()
                                                                    (goto-char (point-min))
                                                                    (org-fc-type-text-input-init)))


 cashpw/org-fc--capture-template--vocab `("Vocab"
                                          :keys "v"
                                          :file ,(lambda () (buffer-name))
                                          :olp ("Flashcards")
                                          :template ("* %^{Term}"
                                                     ":PROPERTIES:"
                                                     ":CREATED: %U"
                                                     ":END:"
                                                     ""
                                                     "%?"
                                                     ""
                                                     "** TODO Source")
                                          :prepare-finalize ,(lambda ()
                                                               (goto-char (point-min))
                                                               (org-fc-type-vocab-init)))

 ;; General
 cashpw/org-capture-templates--todo--todo `("Todo"
                                            :keys "t"
                                            ;;  Can't figure out how to use `cashpw/path--file--notes-todos' here.
                                            :template ("* TODO %?"
                                                       ":PROPERTIES:"
                                                       ":Created: %U"
                                                       ":END:")))

(after! org
  (setq
   org-capture-templates (doct `(,cashpw/org-protocol--capture-template--web-site
                                 (:group "Todo"
                                  :children (("Todo"
                                              :keys "t"
                                              :children (,cashpw/org-roam--capture-template--todo
                                                         ;; ,cashpw/org-capture-templates--todo--todo
                                                         ))))
                                 (:group "Flashcards"
                                  :children (("Flashcards"
                                              :keys "f"
                                              :children (,cashpw/org-fc--capture-template--cloze
                                                         ,cashpw/org-fc--capture-template--double
                                                         ,cashpw/org-fc--capture-template--normal
                                                         ,cashpw/org-fc--capture-template--vocab
                                                         ,cashpw/org-fc--capture-template--text-input))))))
   ))
#+end_src

*** Links

#+begin_src emacs-lisp :tangle packages-personal.el
(after! org
  (setq
   ;; Prefer IDs to filenames+headers when creating links.
   ;; Headers can change, filenames can change, the IDs won't change
   ;; and can move to follow the relevant content.
   org-id-link-to-org-use-id t))
#+end_src

**** Base

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-link-base
  :recipe (:host github
           :repo "cashpw/org-link-base"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-link-base)
#+end_src

