config/doom/config-personal.org
**** Digital Object Identifier (DOI)

See [[*=ol-doi=][=ol-doi=]].

**** ISBN

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-link-isbn
  :recipe (:host github
           :repo "cashpw/org-link-isbn"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-link-isbn)
#+end_src

**** Instagram

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-link-instagram
  :recipe (:host github
           :repo "cashpw/org-link-instagram"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-link-instagram)
#+end_src

**** Twitter

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-link-twitter
  :recipe (:host github
           :repo "cashpw/org-link-twitter"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-link-twitter)
#+end_src

**** Google Documents

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-link-google-doc
  :recipe (:host github
           :repo "cashpw/org-link-google-doc"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-link-google-doc)
#+end_src

**** Google Sheets

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-link-google-sheet
  :recipe (:host github
           :repo "cashpw/org-link-google-sheet"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-link-google-sheet)
#+end_src

**** Amazon

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-link-amazon
  :recipe (:host github
           :repo "cashpw/org-link-amazon"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-link-amazon)
#+end_src

**** Reddit

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-link-reddit
  :recipe (:host github
           :repo "cashpw/org-link-reddit"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-link-reddit
  )
#+end_src

*** Transclusion

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-transclusion
  :after org
  :config
  (setq
   org-transclusion-exclude-elements '(property-drawer
                                       keyword)
   org-transclusion-extensions-loaded t
   org-transclusion-extensions '(org-transclusion-src-lines
                                 org-transclusion-font-lock
                                 org-transclusion-indent-mode))
  (add-hook! 'org-mode-hook 'org-transclusion-mode)
  ;; (set-face-attribute
  ;;  'org-transclusion-fringe nil
  ;;  :foreground "white"
  ;;  :background nil)
  (define-fringe-bitmap 'org-transclusion-fringe-bitmap
    [17 34 68 136 68 34 17]
    nil nil 'center)
  ;; Re-load extensions to activate `org-transclusion-indent-mode'.
  (org-transclusion-load-extensions-maybe t))
#+end_src

*** Latex
#+begin_src emacs-lisp :tangle config-personal.el
(setq org-format-latex-header "\\documentclass{article}
\\usepackage[usenames]{color}
\[DEFAULT-PACKAGES]
\[PACKAGES]
\\pagestyle{empty}             % do not remove
% The settings below are copied from fullpage.sty
\\setlength{\\textwidth}{\\paperwidth}
\\addtolength{\\textwidth}{-3cm}
\\setlength{\\oddsidemargin}{1.5cm}
\\addtolength{\\oddsidemargin}{-2.54cm}
\\setlength{\\evensidemargin}{\\oddsidemargin}
\\setlength{\\textheight}{\\paperheight}
\\addtolength{\\textheight}{-\\headheight}
\\addtolength{\\textheight}{-\\headsep}
\\addtolength{\\textheight}{-\\footskip}
\\addtolength{\\textheight}{-3cm}
\\setlength{\\topmargin}{1.5cm}
\\addtolength{\\topmargin}{-2.54cm}
\\newcommand{\\bigo}[1]{O(#1)}
\\newcommand{\\littleo}[1]{o(#1)}
\\newcommand{\\bigomega}[1]{\\Omega(#1)}
\\newcommand{\\bigtheta}[1]{\\Theta(#1)}
\\newcommand{\\determinant}[1]{\\operatorname{det}(#1)}
")

(defcustom cashpw/latex-toggle-preview--buffers-with-preview-displayed-p
  '("a")
  "List of buffers with latex previews showing.")

(defun cashpw/latex-toggle-preview--current-buffer-has-preview-displayed-p ()
  (member
   (buffer-name (current-buffer))
   cashpw/latex-toggle-preview--buffers-with-preview-displayed-p))

(defun cashpw/latex-toggle-preview--show ()
  (interactive)
  (cl-pushnew (buffer-name (current-buffer))
           cashpw/latex-toggle-preview--buffers-with-preview-displayed-p)
  (org-latex-preview '(16)))

(defun cashpw/latex-toggle-preview--hide ()
  (interactive)
  (setq cashpw/latex-toggle-preview--buffers-with-preview-displayed-p
        (delete (buffer-name (current-buffer))
                cashpw/latex-toggle-preview--buffers-with-preview-displayed-p))
  (org-latex-preview '(64)))

(defun cashpw/latex-toggle-preview ()
  (interactive)
  (if (cashpw/latex-toggle-preview--current-buffer-has-preview-displayed-p)
      (cashpw/latex-toggle-preview--hide)
    (cashpw/latex-toggle-preview--show)))
#+end_src

*** TODO Export and Publish
#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  :config
  (setq
   org-export-with-tags nil))
#+end_src
