config/doom/config-personal.org
***** Config

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-hugo-export-all (&optional directory)
  "Export all hugo files in DIRECTORY."
  (interactive)
  (let* ((directory (or directory
                        (s-lex-format "${cashpw/home-dir-path}/proj/notes")))
         (org-roam-directory directory)
         (files-to-ignore `(,(s-lex-format "${directory}/unread.org")
                            ,(s-lex-format "${directory}/unread2.org")
                            ,(s-lex-format "${directory}/unread3.org")
                            ,(s-lex-format "${directory}/unread4.org")
                            ,(s-lex-format "${directory}/unread5.org")
                            ;; ,(s-lex-format "${directory}/todos.org")
                            ))
         (files-to-export (seq-difference
                           (directory-files
                            directory
                            ;; full
                            t
                            ;; match
                            ".org$")
                           files-to-ignore))
         ;; (files-to-export '("/usr/local/google/home/cashweaver/proj/notes/it_s_a_feature_not_a_bug.org"))
         ;; (files-to-export (-slice files-to-export 1040))
         (count-files-to-export (length
                                 files-to-export))
         (seconds-per-file 4)
         (time-estimate-minutes (/
                                 (* seconds-per-file
                                    count-files-to-export)
                                 60))
         (should-run (y-or-n-p (s-lex-format
                                "Found ${count-files-to-export} nodes in ${directory}. Export estimate: ${time-estimate-minutes} minutes."))))
    (when should-run
      (let* ((progress-reporter (make-progress-reporter "Exporting roam notes"
                                                        0
                                                        (length files-to-export)))
             (start-time (current-time))
             (org-id-extra-files (org-roam-list-files))
             (i 0))
        ;; Speed up the export
        (remove-hook! 'org-mode-hook #'org-fancy-priorities-mode)
        (advice-add 'org-id-find :override 'org-roam-id-find)
        (memoize 'org-roam-node-id)
        (memoize 'org-roam-node-file)

        (save-excursion
          (mapc
           (lambda (filepath)
             (let ((inner-start-time (current-time))
                   (inhibit-message t))
               (message "cashpw/org-hugo-export-all (%d/%d) exporting [%s]"
                        (1+ i)
                        count-files-to-export
                        filepath)
               (with-current-buffer (find-file-noselect filepath)
                 (ignore-errors
                 (org-hugo-export-to-md)))
               (message "cashpw/org-hugo-export-all (%d/%d) exported [%s] %.06f"
                        (1+ i)
                        count-files-to-export
                        filepath
                        (float-time (time-since inner-start-time))))
             (progress-reporter-update progress-reporter
                                       i)
             (setq i (1+ i)))
           files-to-export))
        (progress-reporter-done progress-reporter)

        ;; Remove speed-up changes
        (add-hook! 'org-mode-hook #'org-fancy-priorities-mode)
        (advice-remove 'org-id-find 'org-roam-id-find)
        (memoize-restore 'org-roam-node-id)
        (memoize-restore 'org-roam-node-file)

        (message "cashpw/org-hugo-export-all %.06f" (float-time (time-since start-time)))))))

(defun cashpw/org-mode--split-tags-to-list (tags-as-string)
  "Strip the wrapping ':' from TAG; if present."
  (if tags-as-string
      (if (string-match
           "^:\\(.*\\):$"
           tags-as-string)
          (split-string
           (match-string 1 tags-as-string)
           ":")
        nil)
    nil))

(defun cashpw/org-hugo--tag-processing-fn-roam-tags (tag-list info)
  "Add tags from filetags to tag-list for org-roam to ox-hugo compatibility.

Reference: https://sidhartharya.me/exporting-org-roam-notes-to-hugo/#goal

See `org-hugo-tag-processing-functions'."
  (if (org-roam-file-p)
      (let* ((filetags
              (car
               (cdr
                (assoc-string
                 "FILETAGS"
                 (org-collect-keywords
                  '("FILETAGS"))))))
             (filetag-list
              (or
               (cashpw/org-mode--split-tags-to-list
                filetags)
               '())))
        (append tag-list
                (mapcar
                 #'downcase
                 filetag-list)))
    tag-list))

(after! ox-hugo
  (setq
   org-hugo-allow-spaces-in-tags nil)
  (add-to-list
   'org-hugo-tag-processing-functions
   'cashpw/org-hugo--tag-processing-fn-roam-tags)
  ;; Speed up exporting files
  ;; (advice-add 'org-id-find :override 'org-roam-id-find)
  ;; (memoize 'org-roam-node-id)
  ;; (memoize 'org-roam-node-file)
  )
#+end_src

#+RESULTS:
| cashpw/org-hugo--tag-processing-fn-roam-tags | org-hugo--tag-processing-fn-replace-with-spaces-maybe | org-hugo--tag-processing-fn-replace-with-hyphens-maybe |

**** Publish

#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  (setq
   org-publish-project-alist
   '(("cashweaver.com"
      :base-directory "~/proj/blog-posts/posts/"
      :base-extension "org"
      :publishing-directory "~/proj/cashweaver.com/content/posts/"
      ;;:publishing-function org-pandoc-publish-to-md
      :publishing-function org-hugo-export-to-md
      :section-numbers t
      :with-toc nil))))

;; Publish org-roam files without using org-publish because org-publish requires a top-level headline.
;; ("roam"
;; :base-directory "~/proj/notes/"
;; :base-extension "org"
;; :publishing-directory "~/proj/cashweaver.com/content/posts/"
;; :publishing-function org-hugo-export-to-md
;; :table-of-contents nil
;; :section-numbers t
;; :with-toc nil))))


#+end_src

**** Helper Functions

#+begin_src emacs-lisp :tangle config-personal.el
(defcustom
  cashpw/smart-to-ascii
  '(("\x201C" . "\"")
    ("\x201D" . "\"")
    ("\x2018" . "'")
    ("\x2019" . "'"))
  "Mapping from known 'smart' quotes/etc to their ascii equivalent.")

(defun cashpw/replace-smart-quotes (beg end)
  "Replace 'smart quotes' in buffer or region with ascii quotes.

Reference: https://superuser.com/a/604264"
  (interactive "r")
  (format-replace-strings
   cashpw/smart-to-ascii
   nil
   beg
   end))

(defun cashpw/replace-smart-quotes-in-buffer ()
  "Replace 'smart quotes' in current buffer."
  (interactive)
  (cashpw/replace-smart-quotes
   (point-min)
   (point-max)))
#+end_src

*** Mail

See [[*Mail][Mail]].

*** TODO Citations

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 cashpw/path--roam-bibliography
 (format "%s/proj/notes/bibliography.bib"
         cashpw/home-dir-path)
 cashpw/bibliographies `(,cashpw/path--roam-bibliography))
#+end_src

