config/doom/config-personal.org
*** Known Projects

#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashpw/project-path-fns
  '()
  "List of functions which return a list of project paths.")

(defun cashpw/get-proj-dir-paths (&optional projects-to-exclude proj-dir-path)
  "Return a list of absolute paths to project directories.

Exclude project names listed in PROJECTS-TO-EXCLUDE."
  (let* ((projects-to-exclude
          (or
           projects-to-exclude
           '()))
         (proj-dir-path
          (or
           proj-dir-path
           (format
            "%s/proj"
            cashpw/home-dir-path)))
         (proj-names
          (cl-remove-if
           (lambda (file-name)
             (or
              (member file-name projects-to-exclude)
              (string= ".." file-name)
              (string= "." file-name)
              (not (f-dir?
                    (expand-file-name
                     file-name
                     proj-dir-path)))))
           (directory-files
            proj-dir-path)))
         (absolute-proj-dir-paths
          (mapcar
           (lambda (proj-name)
             (format "%s/%s"
                     proj-dir-path
                     proj-name))
           proj-names)))
    absolute-proj-dir-paths))

(add-to-list
 'cashpw/project-path-fns
 'cashpw/get-proj-dir-paths)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(defvar cashpw/gdrive-mount-dir-path
  "/mnt/cashbweaver-gdrive"
  "Absoltue path to personal Google Drive mount.")

(defvar cashpw/gdrive-notes-dir-path
  (format "%s/notes"
          cashpw/gdrive-mount-dir-path)
  "Absolute path to personal notes directory in Google Drive.")

;; (add-to-list
;;  'cashpw/project-paths
;;  cashpw/gdrive-notes-dir-path)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/maybe-add-trailing-forward-slash (str)
  "Return STR with a trailing slash (added if it was missing)."
  (if (s-ends-with? "/" str)
      str
    (format "%s/" str)))

(defun cashpw/get-flattened-known-project-paths ()
  "Return a list of all known project paths"
  (let* ((nested-paths
          (cl-loop for fn in cashpw/project-path-fns
                collect (funcall fn)))
         (paths
          (mapcar
           (lambda (path)
             (cashpw/maybe-add-trailing-forward-slash path))
           (flatten-tree
            nested-paths))
          ))
    paths))

(defun cashpw/projectile-refresh-known-paths ()
  "Refresh the paths which projectile knows about."
  (interactive)
  (projectile-clear-known-projects)
  (setq projectile-known-projects
        (cashpw/get-flattened-known-project-paths)))

(after! projectile
  (cashpw/projectile-refresh-known-paths))
#+end_src

* Key bindings
* Wishlist
** TODO [#4] Create roam node from link at point
:PROPERTIES:
:Effort:   2h
:END:
Create a new roam node using the link at point. Pull the title used at the URL under the link; let the user override if they want to. Include the link in the node's refs.

** TODO [#2] See if I can extract anything else from =config-work.org=
** TODO [#4] =s/cashpw//cashweaver\//= for my methods
:PROPERTIES:
:Effort:   1h
:END:
** TODO [#2] Write about my use of =org-roam=, =hugo=, etc
:PROPERTIES:
:Effort:   4h
:END:

* Bucket

Bits that I haven't yet filed into a larger heading

** INPROGRESS Rewrite "raw" links in buffer into org-mode links

#+begin_src emacs-lisp
;; https ://docs.google.com/document/d/1OqMKeO-XnvD8qK6qH0u_TplZrofVYqG_R4VGeLbAklM/edit #heading=h.hy2rqfrcolct

(setq
 cashpw/rewrite-links--match--google-sheets "https?://docs.google.com/spreadsheets/d/\\([A-Za-z0-9-_]+\\)"
 cashpw/rewrite-links-matches `((,cashpw/rewrite-links--match--google-docs . "google-docs")))

(defun cashpw/rewrite-links ()
  "Rewrite raw links in the current buffer into org links."
  (interactive)
  (save-excursion
    (goto-char
     (point-min))
    (while
        (search-forward-regexp
         cashpw/rewrite-links--match--google-sheets
         ;; bound
         nil
         ;; noerror
         t)
      (replace-match
       (cashpw/org-link--google-sheets-build-org-link
        ;; sheet-id
        (match-string 1)
        ;; description
        "Google Sheet")
       )))

  ;; (let ((link-regexps
  ;;        `(,cashpw/rewrite-links--match--google-docs)))
  ;;   ())
  )

(cashpw/rewrite-links)
#+end_src

** Replace selected text in buffer

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/replace-selection ()
  (interactive)
  (let* ((register ?\")
         (to-replace (replace-regexp-in-string
                      "/"
                      "\\\\/"
                      (progn
                        (evil-yank (mark)
                                   (point)
                                   nil
                                   register)
                        (evil-get-register register)))))
    (evil-ex (s-lex-format  "%s/${to-replace}/"))))
#+end_src

** Reload dir-local variables

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/reload-dir-locals-for-current-buffer ()
  "Reload dir locals for the current buffer"
  (interactive)
  (let ((enable-local-variables :all))
    (hack-dir-local-variables-non-file-buffer)))
#+end_src

** TOML

#+begin_src emacs-lisp :tangle packages-personal.el
(package! toml
  :recipe (:host github
           :repo "gongo/emacs-toml"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! toml)
#+end_src

#+begin_src emacs-lisp
;; (yaml-parse-string "
;; title = \"this is the title\"
;; draft = false")
(toml:read-from-string "
title = \"this is the title\"
author = [\"cashweaver\"]
date = 2022-02-10T09:33:00-08:00
draft = true")
#+end_src

** =electric-case=
#+begin_src emacs-lisp :tangle packages-personal.el
(package! electric-case
  :recipe (:host github
           :repo "zk-phi/electric-case"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! electric-case)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
;; (add-hook!
;;  'java-mode-hook
;;  'electric-case-java-init)
#+end_src

** roam for all

#+begin_src emacs-lisp
(defun cashpw/current-buffer-contains-string (target)
  (save-excursion
    (save-match-data
      (goto-char (point-min))
      (search-forward target
                      ;; bound
                      nil
                      ;; noerror
                      t))))

(defun cashpw/org-roam-resolve-failures ()
  (interactive)
  (when (cashpw/current-buffer-contains-string "ANKI_FAILURE_REASON: Note was not found")
    (org-map-entries
     (lambda ()
       (org-delete-property
        "ANKI_NOTE_ID"))
     "+ANKI_FAILURE_REASON={Note was not found.*}")))


(defun cashpw/org-roam-push-anki-notes ()
  (interactive)
  (let* ((org-hugo-auto-set-lastmod nil)
         (org-roam-directory cashpw/roam-dir-path)
         (org-roam-files (split-string
                          (shell-command-to-string
                           (s-lex-format
                            "cd ${org-roam-directory}; grep -rl \":ANKI_DECK:\""))))
         (progress-reporter (make-progress-reporter "Pushing anki notes"
                                                    0
                                                    (length org-roam-files)))
         (i 0))
    (org-hugo-auto-export-mode)
    (mapcar
     (lambda (file)
       (org-roam-with-file file nil
         (let ((inhibit-message t))
           ;; (anki-editor-push-notes)
           ;; (cashpw/org-roam-resolve-failures)
           (anki-editor-push-notes)
           (save-buffer))
         (progress-reporter-update progress-reporter
                                   i)

         (setq
          i (+ i 1))))
     org-roam-files)
    (progress-reporter-done progress-reporter)))

#+end_src

