config/doom/config-personal.org
** Roam: export all

#+begin_src emacs-lisp
(defmacro measure-time (&rest body)
  "Measure the time it takes to evaluate BODY.

Reference:https://stackoverflow.com/q/23622296"
  `(let ((start-time (current-time)))
     ,@body
     (message "%.06f"
              (float-time (time-since start-time)))))
#+end_src

#+begin_src emacs-lisp
(defun cashpw/org-roam-in-all-files (fn description expected-seconds-per-file)
  "Run FN on all Roam files."
  (interactive)
  (let* ((org-roam-directory cashpw/roam-dir-path)
         (org-roam-files (org-roam-list-files))
         ;; (org-roam-files (cl-subseq (org-roam-list-files) 0 15))
         ;; (org-roam-files `(,(nth 0 (org-roam-list-files))))
         (count-org-roam-files (length org-roam-files))
         (progress-reporter (make-progress-reporter description
                                                    0
                                                    (length org-roam-files)))
         (expected-total-run-time (seconds-to-string (* expected-seconds-per-file
                                                        count-org-roam-files)))
         (prompt (s-lex-format "${count-org-roam-files} found. Export expected to take ${expected-total-run-time}. Continue? "))
         (should-run (y-or-n-p prompt))
         (i 0))
    (when should-run
      (mapcar
       (lambda (file)
         (org-roam-with-file file
             ;; keep-buf-p
             nil
           (let ((inhibit-message t))
             (funcall fn))
           (progress-reporter-update progress-reporter
                                     i)
           (setq
            i (+ i 1))))
       org-roam-files)
      (progress-reporter-done progress-reporter))))


(defun cashpw/org-roam-export-hugo ()
  (interactive)
  (measure-time
   (let* ((org-hugo-auto-set-lastmod nil)
          (description "Exporting roam notes")
          (expected-seconds-per-file 3.0
                                     ;; Determined by timing the export of 100 files.
                                     ))
     (cashpw/org-roam-in-all-files
      'cashpw/org-hugo-export-wim-to-md
      description
      expected-seconds-per-file))))

(defun cashpw/org-roam-save-all ()
  (interactive)
  (measure-time
   (let* ((org-hugo-auto-set-lastmod nil)
          (description "Saving roam notes")
          (expected-seconds-per-file 3.0
                                     ;; Determined by timing the export of 100 files.
                                     ))
     (cashpw/org-roam-in-all-files
      (lambda ()
        (set-buffer-modified-p t)
        (save-buffer))
      description
      expected-seconds-per-file))))

(defun cashpw/org-roam-save-front-matter ()
  (interactive)
  (measure-time
   (let* ((org-hugo-auto-set-lastmod nil)
          (before-save-hook '())
          (description "Saving roam notes")
          (expected-seconds-per-file 3.0
                                     ;; Determined by timing the export of 100 files.
                                     ))
     (cashpw/org-roam-in-all-files
      (lambda ()
        (let ((before-save-hook '()))
          (cashpw/set-custom-front-matter)
          (save-buffer)))
      description
      expected-seconds-per-file))))

(defun cashpw/org-roam-export-hugo-bak ()
  (interactive)
  (let* ((org-hugo-auto-set-lastmod nil)
         (org-roam-directory cashpw/roam-dir-path)
         (org-roam-files (org-roam-list-files))
         (count-org-roam-files (length org-roam-files))
         (progress-reporter (make-progress-reporter "Exporting roam notes"
                                                    0
                                                    (length org-roam-files)))
         (expected-seconds-per-file 1.43
                                    ;; Determined by timing the export of 100 files.
                                    )
         (expected-total-run-time (seconds-to-string (* expected-seconds-per-file
                                                        count-org-roam-files)))
         (prompt (s-lex-format "${count-org-roam-files} found. Export expected to take ${expected-total-run-time}. Continue? "))
         (should-export (y-or-n-p prompt))
         (i 0))
    (when should-export
      ;; Enable hugo auto-export mode
      (org-hugo-auto-export-mode)
      ;; Disable anki-editor-mode
      (anki-editor-mode t)
      (mapcar
       (lambda (file)
         (org-roam-with-file file nil
           (let ((inhibit-message t))
             (cashpw/org-hugo-export-wim-to-md))
           (progress-reporter-update progress-reporter
                                     i)
           (setq
            i (+ i 1))))
       org-roam-files)
      (progress-reporter-done progress-reporter))))
#+end_src


#+begin_src emacs-lisp :tangle config-personal.el
(defun cashpw/org-roam-push-anki ()
  (interactive)
  (measure-time
   (let* ((org-hugo-auto-set-lastmod nil)
          (description "Pushing anki cards")
          (expected-seconds-per-file 3.0
                                     ;; Determined by timing the export of 100 files.
                                     ))

     (let ((export-file-name "/tmp/anki.org")
           (export-buffer-name "*Org ORG Export*")
           (anki-heading-regexp "\\* \\(TODO \\)?\\(\\[#2\\] \\)?Anki"))
       ;; Clear /tmp/anki.org
       (with-current-buffer (find-file-noselect
                             export-file-name)
         (erase-buffer)
         (goto-char (point-min))
         (insert "#+PROPERTY: ANKI_DECK Default\n\n")
         (save-buffer))

       ;; Export all anki cards to /tmp/anki.org
       (cashpw/org-roam-in-all-files
        (lambda ()
          (let ((before-save-hook '())
                (org-export-with-title nil)
                (org-export-with-date nil)
                (org-export-with-author nil)
                (org-export-with-creator nil)
                (org-export-with-properties t)
                (org-global-properties '(("ANKI_DECK" . "DEFAULT")))
                (anki-heading-regexp "\\* \\(TODO \\)?\\(\\[#2\\] \\)?Anki"))
            (org-mode)
            (when (buffer-contains-regexp anki-heading-regexp)
              (goto-char (point-min))
              (search-forward-regexp anki-heading-regexp)
              (org-org-export-as-org
               ;; async
               nil
               ;; subtreep
               t)
              (set-buffer-modified-p nil)
              (with-current-buffer (find-file-noselect
                                    export-file-name)
                (goto-char (point-max))
                (insert
                 (with-current-buffer export-buffer-name
                   (goto-char (point-min))
                   ;; Remove "# Created YYYY-MM-DD ..."
                   (kill-whole-line)
                   (set-buffer-modified-p nil)
                   (buffer-substring-no-properties (point-min)
                                                   (point-max))))
                (save-buffer))
              )))
        description
        expected-seconds-per-file)

       ;; Push cards
       (with-current-buffer (find-file-noselect
                             export-file-name)
         (anki-editor-push-notes))
       ))))

#+end_src

#+begin_src emacs-lisp
(defun cashpw/foo ()
  (interactive)
  (shell-command "cd ~/proj/notes; echo \"\" > all-anki.org")
  (shell-command "for f in *.org; do [[ \"$f\" != \"todos.org\" ]] && [[ \"$f\" != \"unread.org\" ]] && cat $f | sed -E '0,/^\\* (TODO )?(\\[#2\\] )?Anki/d' | sed '0,/:END:/d' >> all-anki.org; done")
  (let ((org-global-properties '(("ANKI_DECK" . "DEFAULT"))))
    (with-current-buffer (find-file-noselect
                          "~/proj/notes/all-anki.org")
      (anki-editor-push-notes))
    ))

;; (cashpw/foo)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
;; Reference: https://notes.alexkehayias.com/exporting-org-mode-documents-with-many-org-id-links-is-slow/
(after! ox
  ;; Org export is very slow when processing org-id links. Override it
  ;; to skip opening the file and loading all modes.
  (defun org-export--collect-tree-properties (data info)
    "Extract tree properties from parse tree.

    DATA is the parse tree from which information is retrieved.  INFO
    is a list holding export options.

    Following tree properties are set or updated:

    `:headline-offset' Offset between true level of headlines and
                       local level.  An offset of -1 means a headline
                       of level 2 should be considered as a level
                       1 headline in the context.

    `:headline-numbering' Alist of all headlines as key and the
                          associated numbering as value.

    `:id-alist' Alist of all ID references as key and associated file
                as value.

    Return updated plist."
    ;; Install the parse tree in the communication channel.
    (setq info (plist-put info :parse-tree data))
    ;; Compute `:headline-offset' in order to be able to use
    ;; `org-export-get-relative-level'.
    (setq info
          (plist-put info
                     :headline-offset
                     (- 1 (org-export--get-min-level data info))))
    ;; From now on, properties order doesn't matter: get the rest of the
    ;; tree properties.
    (org-combine-plists
     info
     (list :headline-numbering (org-export--collect-headline-numbering data info)
           :id-alist
           (org-element-map data 'link
             (lambda (l)
               (and (string= (org-element-property :type l) "id")
                    (let* ((id (org-element-property :path l))
                           (file (org-id-find-id-file id)))
                      (and file (cons id (file-relative-name file)))))))))))
#+end_src

