config/doom/config-personal.el
          (description "Pushing anki cards")
          (expected-seconds-per-file 3.0
                                     ;; Determined by timing the export of 100 files.
                                     ))

     (let ((export-file-name "/tmp/anki.org")
           (export-buffer-name "*Org ORG Export*")
           (anki-heading-regexp "\\* \\(TODO \\)?\\(\\[#2\\] \\)?Anki"))
       ;; Clear /tmp/anki.org
       (with-current-buffer (find-file-noselect
                             export-file-name)
         (erase-buffer)
         (goto-char (point-min))
         (insert "#+PROPERTY: ANKI_DECK Default\n\n")
         (save-buffer))

       ;; Export all anki cards to /tmp/anki.org
       (cashpw/org-roam-in-all-files
        (lambda ()
          (let ((before-save-hook '())
                (org-export-with-title nil)
                (org-export-with-date nil)
                (org-export-with-author nil)
                (org-export-with-creator nil)
                (org-export-with-properties t)
                (org-global-properties '(("ANKI_DECK" . "DEFAULT")))
                (anki-heading-regexp "\\* \\(TODO \\)?\\(\\[#2\\] \\)?Anki"))
            (org-mode)
            (when (buffer-contains-regexp anki-heading-regexp)
              (goto-char (point-min))
              (search-forward-regexp anki-heading-regexp)
              (org-org-export-as-org
               ;; async
               nil
               ;; subtreep
               t)
              (set-buffer-modified-p nil)
              (with-current-buffer (find-file-noselect
                                    export-file-name)
                (goto-char (point-max))
                (insert
                 (with-current-buffer export-buffer-name
                   (goto-char (point-min))
                   ;; Remove "# Created YYYY-MM-DD ..."
                   (kill-whole-line)
                   (set-buffer-modified-p nil)
                   (buffer-substring-no-properties (point-min)
                                                   (point-max))))
                (save-buffer))
              )))
        description
        expected-seconds-per-file)

       ;; Push cards
       (with-current-buffer (find-file-noselect
                             export-file-name)
         (anki-editor-push-notes))
       ))))

;; Reference: https://notes.alexkehayias.com/exporting-org-mode-documents-with-many-org-id-links-is-slow/
(after! ox
  ;; Org export is very slow when processing org-id links. Override it
  ;; to skip opening the file and loading all modes.
  (defun org-export--collect-tree-properties (data info)
    "Extract tree properties from parse tree.

    DATA is the parse tree from which information is retrieved.  INFO
    is a list holding export options.

    Following tree properties are set or updated:

    `:headline-offset' Offset between true level of headlines and
                       local level.  An offset of -1 means a headline
                       of level 2 should be considered as a level
                       1 headline in the context.

    `:headline-numbering' Alist of all headlines as key and the
                          associated numbering as value.

    `:id-alist' Alist of all ID references as key and associated file
                as value.

    Return updated plist."
    ;; Install the parse tree in the communication channel.
    (setq info (plist-put info :parse-tree data))
    ;; Compute `:headline-offset' in order to be able to use
    ;; `org-export-get-relative-level'.
    (setq info
          (plist-put info
                     :headline-offset
                     (- 1 (org-export--get-min-level data info))))
    ;; From now on, properties order doesn't matter: get the rest of the
    ;; tree properties.
    (org-combine-plists
     info
     (list :headline-numbering (org-export--collect-headline-numbering data info)
           :id-alist
           (org-element-map data 'link
             (lambda (l)
               (and (string= (org-element-property :type l) "id")
                    (let* ((id (org-element-property :path l))
                           (file (org-id-find-id-file id)))
                      (and file (cons id (file-relative-name file)))))))))))
