config/doom/config-personal.el

(use-package! org-capture-ref)
(use-package! asoc)

(let ((templates (doct '( :group "Browser link"
                          :type entry
                          :file "~/proj/notes/bibliography.org"
                          :fetch-bibtex (lambda () (org-capture-ref-process-capture)) ; this must run first
                          :bibtex (lambda () (org-capture-ref-get-bibtex-field :bibtex-string))
                          :extra (lambda () (if (org-capture-ref-get-bibtex-field :journal)
                                                (s-join "\n"
                                                        '("- [ ] download and attach pdf"
                                                          "- [ ] [[elisp:org-attach-open][read paper capturing interesting references]]"
                                                          "- [ ] [[elisp:(browse-url (url-encode-url (format \"https://www.semanticscholar.org/search?q=%s\" (org-entry-get nil \"TITLE\"))))][check citing articles]]"
                                                          "- [ ] [[elisp:(browse-url (url-encode-url (format \"https://www.connectedpapers.com/search?q=%s\" (org-entry-get nil \"TITLE\"))))][check related articles]]"
                                                          "- [ ] check if bibtex entry has missing fields"))
                                              ""))
                          :org-entry (lambda () (org-capture-ref-get-org-entry))
                          :template
                          ("%{fetch-bibtex}* TODO %?%{space}%{org-entry}"
                           "%{extra}"
                           "#+begin_src bibtex :tangle bibliography.bib"
                           "%{bibtex}"
                           "#+end_src")
                          :children (("Interactive link"
                                      :keys "b"
                                      :space " "
                                      )
                                     ("Silent link"
                                      :keys "B"
                                      :space ""
                                      :immediate-finish t))))))
  (dolist (template templates)
    (asoc-put! org-capture-templates
               (car template)
               (cdr  template)
               'replace)))

(use-package! memoize)

(defun cashpw/anki-editor-insert-note ()
  (interactive)
  (with-current-buffer
      (find-file-noselect
       "~/proj/anki-cards/anki.org")
    (point-min)
    (anki-editor-insert-note)))

(defun cashpw/pointer-between-chars-p (chars-before chars-after &optional explicit)
  "Return t if the pointer is between the provided chars.

Examples (| is the pointer):
  - \"abc|dab\": (cashpw/pointer-between-chars-p \"c\" \"d\") -> t
  - \"abc|dab\": (cashpw/pointer-between-chars-p \"a\" \"b\") -> t
  - \"abc|dab\": (cashpw/pointer-between-chars-p \"a\" \"b\" t) -> nil
  - \"aFc|dab\": (cashpw/pointer-between-chars-p \"a\" \"b\" t) -> t"
  (let* ((bol (save-excursion
                (beginning-of-line)))
         (eol (save-excursion
                (end-of-line)))
         (pos-chars-before (save-excursion
                             (search-backward chars-before bol t)
                             (point)))
         (pos-chars-after (save-excursion
                            (search-forward chars-after eol t)
                            (point)))
         (char-at-point (char-after (point)))
         (point-between-chars (and
                               ;; pos-chars-before < (point) < chars-after-point
                               (> (point)
                                  pos-chars-before)
                               (< (point)
                                  pos-chars-after))))
    ;; (message (buffer-substring (line-beginning-position)
    ;;                            (line-end-position)))
    ;; (message (concat
    ;;           "(point): "
    ;;           (number-to-string (point))))
    ;; (message (s-lex-format
    ;;           "char-at-point: ${char-at-point}"))
    ;; (message (s-lex-format
    ;;           "pos-chars-before: ${pos-chars-before}"))
    ;; (message (s-lex-format
    ;;           "pos-chars-after: ${pos-chars-after}"))
    (if explicit
        (let* ((pos-prev-chars-after (save-excursion
                                       (search-backward chars-after eol t)
                                       (point))))
          ;; (message (s-lex-format
          ;;           "pos-prev-chars-after: ${pos-prev-chars-after}"))
          ;; (message (s-lex-format
          ;;           "point-between-chars: ${point-between-chars}"))
          (cond
           ((not point-between-chars)
            nil)
           ((= pos-prev-chars-after
               (point))
            t)
           ((< pos-prev-chars-after
               (point))
            nil)))
      point-between-chars)))

;; test cases
(with-temp-buffer
  (insert "[e]")
  (goto-char 2)
  (cl-assert
   (cashpw/pointer-between-chars-p "[" "]")))
(with-temp-buffer
  (insert "[]e[]")
  (goto-char 3)
  (cl-assert
   (cashpw/pointer-between-chars-p "[" "]")))
(with-temp-buffer
  (insert "[ced[]")
  (goto-char 3)
  (cl-assert
   (cashpw/pointer-between-chars-p "[" "]" t)))
(with-temp-buffer
  (insert "[]ced[]")
  (goto-char 4)
  (cl-assert
   (not (cashpw/pointer-between-chars-p "[" "]" t))))


(defun cashpw/bounds-of-chars-surrounding-point (before after)
  (interactive)
  (let* ((bol (save-excursion
                (beginning-of-line)))
         (eol (save-excursion
                (end-of-line)))
         (end (save-excursion
                (search-forward after eol t)
                (point)))
         (begin (save-excursion
                  (search-backward before bol t)
                  (point))))
    `(,begin . ,end)))

(defun cashpw/pointer-in-link-p ()
  (cashpw/pointer-between-chars-p "[[" "]]"))

(defun cashpw/bounds-of-link-at-point ()
  (cashpw/bounds-of-chars-surrounding-point "[[" "]]"))

(defun cashpw/pointer-in-mathjax-p ()
  (cashpw/pointer-between-chars-p "\\(" "\\)"))

(defun cashpw/bounds-of-mathjax-at-point ()
  (cashpw/bounds-of-chars-surrounding-point "\\(" "\\)"))

(defun cashpw/anki-editor-cloze-dwim (&optional arg hint)
  "Cloze current active region or a word the under the cursor"
  (interactive "p\nsHint (optional): ")
  (cond
   ((region-active-p)
    (anki-editor-cloze (region-beginning) (region-end) arg hint))
   ((cashpw/pointer-in-link-p)
    (let ((bounds (cashpw/bounds-of-link-at-point)))
      (anki-editor-cloze (car bounds)
                         (cdr bounds)
                         arg
                         hint)))
   ((cashpw/pointer-in-mathjax-p)
    (let ((bounds (cashpw/bounds-of-mathjax-at-point)))
      (anki-editor-cloze (car bounds)
                         (cdr bounds)
                         arg
                         hint)))
   ((thing-at-point 'word)
    (let ((bounds (bounds-of-thing-at-point
                   'word)))
      (message "word")
      (anki-editor-cloze (car bounds)
                         (cdr bounds)
                         arg
                         hint)))
   (t
    (error "Nothing to create cloze from"))))
